// Thailand GPS Coordinates Data
// Source: https://github.com/rathpanyowat/Thai-zip-code-latitude-and-longitude

export interface Coordinates {
  lat: number;
  lng: number;
}

export const provinceCoordinates: { [key: string]: Coordinates } = {
  "กรุงเทพมหานคร": {
    "lat": 13.7560243,
    "lng": 100.4986793
  },
  "สมุทรปราการ": {
    "lat": 13.6213747,
    "lng": 100.5992148
  },
  "นนทบุรี": {
    "lat": 13.8658492,
    "lng": 100.4941285
  },
  "ปทุมธานี": {
    "lat": 13.9854373,
    "lng": 100.5521142
  },
  "พระนครศรีอยุธยา": {
    "lat": 14.3523939,
    "lng": 100.5521142
  },
  "อ่างทอง": {
    "lat": 14.5895914,
    "lng": 100.4550554
  },
  "ลพบุรี": {
    "lat": 14.7996306,
    "lng": 100.6343005
  },
  "สิงห์บุรี": {
    "lat": 14.8997786,
    "lng": 100.4059456
  },
  "ชัยนาท": {
    "lat": 15.1252422,
    "lng": 100.1423172
  },
  "สระบุรี": {
    "lat": 14.5288823,
    "lng": 100.9101032
  },
  "ชลบุรี": {
    "lat": 13.3909924,
    "lng": 101.0122861
  },
  "ระยอง": {
    "lat": 12.6754092,
    "lng": 101.3658004
  },
  "จันทบุรี": {
    "lat": 12.6112485,
    "lng": 102.1037806
  },
  "ตราด": {
    "lat": 12.2427059,
    "lng": 102.5174726
  },
  "ฉะเชิงเทรา": {
    "lat": 13.6592703,
    "lng": 101.0717963
  },
  "ปราจีนบุรี": {
    "lat": 14.0552548,
    "lng": 101.3784849
  },
  "นครนายก": {
    "lat": 14.2038387,
    "lng": 101.2268773
  },
  "สระแก้ว": {
    "lat": 13.8240407,
    "lng": 102.0645821
  },
  "นครราชสีมา": {
    "lat": 14.9415189,
    "lng": 102.1175404
  },
  "บุรีรัมย์": {
    "lat": 14.8905684,
    "lng": 103.035694
  },
  "สุรินทร์": {
    "lat": 14.8828674,
    "lng": 103.4937242
  },
  "ศรีสะเกษ": {
    "lat": 15.1170086,
    "lng": 104.3274123
  },
  "อุบลราชธานี": {
    "lat": 15.2286712,
    "lng": 104.8564472
  },
  "ยโสธร": {
    "lat": 15.7983959,
    "lng": 104.1495096
  },
  "ชัยภูมิ": {
    "lat": 15.806777,
    "lng": 102.029293
  },
  "อำนาจเจริญ": {
    "lat": 15.8656422,
    "lng": 104.6257269
  },
  "บึงกาฬ": {
    "lat": 18.3608748,
    "lng": 103.6464504
  },
  "หนองบัวลำภู": {
    "lat": 17.2218369,
    "lng": 102.4260602
  },
  "ขอนแก่น": {
    "lat": 16.4549378,
    "lng": 102.8563594
  },
  "อุดรธานี": {
    "lat": 17.3980165,
    "lng": 102.7594847
  },
  "เลย": {
    "lat": 17.4605379,
    "lng": 101.7523854
  },
  "หนองคาย": {
    "lat": 17.8841733,
    "lng": 102.750128
  },
  "มหาสารคาม": {
    "lat": 16.1383681,
    "lng": 103.2894368
  },
  "ร้อยเอ็ด": {
    "lat": 16.0537909,
    "lng": 103.6519972
  },
  "กาฬสินธุ์": {
    "lat": 16.438508,
    "lng": 103.5060994
  },
  "สกลนคร": {
    "lat": 17.1435494,
    "lng": 104.1233667
  },
  "นครพนม": {
    "lat": 17.3798237,
    "lng": 104.6821048
  },
  "มุกดาหาร": {
    "lat": 16.537152,
    "lng": 104.7154762
  },
  "เชียงใหม่": {
    "lat": 18.7952345,
    "lng": 98.9355737
  },
  "ลำพูน": {
    "lat": 18.5744058,
    "lng": 99.0087343
  },
  "ลำปาง": {
    "lat": 18.4219661,
    "lng": 99.5896043
  },
  "อุตรดิตถ์": {
    "lat": 17.7332664,
    "lng": 100.2151578
  },
  "แพร่": {
    "lat": 18.103139,
    "lng": 100.3048897
  },
  "น่าน": {
    "lat": 18.7756094,
    "lng": 100.7730685
  },
  "พะเยา": {
    "lat": 19.1664466,
    "lng": 99.9019888
  },
  "เชียงราย": {
    "lat": 19.9104798,
    "lng": 99.840576
  },
  "แม่ฮ่องสอน": {
    "lat": 19.2990244,
    "lng": 97.9656213
  },
  "นครสวรรค์": {
    "lat": 15.6987382,
    "lng": 100.11996
  },
  "อุทัยธานี": {
    "lat": 15.4375499,
    "lng": 100.0135929
  },
  "กำแพงเพชร": {
    "lat": 16.4801833,
    "lng": 99.5204467
  },
  "ตาก": {
    "lat": 16.8839446,
    "lng": 99.1259054
  },
  "สุโขทัย": {
    "lat": 16.9809658,
    "lng": 99.8348146
  },
  "พิษณุโลก": {
    "lat": 16.8211238,
    "lng": 100.2658516
  },
  "พิจิตร": {
    "lat": 16.4418293,
    "lng": 100.3722477
  },
  "เพชรบูรณ์": {
    "lat": 16.3754838,
    "lng": 101.207047
  },
  "ราชบุรี": {
    "lat": 13.5282953,
    "lng": 99.8135584
  },
  "กาญจนบุรี": {
    "lat": 14.0103702,
    "lng": 99.5624106
  },
  "สุพรรณบุรี": {
    "lat": 14.4861012,
    "lng": 100.1255164
  },
  "นครปฐม": {
    "lat": 13.8140293,
    "lng": 100.0372929
  },
  "สมุทรสาคร": {
    "lat": 13.5489008,
    "lng": 100.2739306
  },
  "สมุทรสงคราม": {
    "lat": 13.4094552,
    "lng": 100.0019995
  },
  "เพชรบุรี": {
    "lat": 13.0957579,
    "lng": 99.9688636
  },
  "ประจวบคีรีขันธ์": {
    "lat": 11.7938389,
    "lng": 99.7957564
  },
  "นครศรีธรรมราช": {
    "lat": 8.4235956,
    "lng": 99.9618712
  },
  "กระบี่": {
    "lat": 8.1673273,
    "lng": 98.8803925
  },
  "พังงา": {
    "lat": 8.4352303,
    "lng": 98.5281613
  },
  "ภูเก็ต": {
    "lat": 7.8741947,
    "lng": 98.3939158
  },
  "สุราษฎร์ธานี": {
    "lat": 9.1367639,
    "lng": 99.3007367
  },
  "ระนอง": {
    "lat": 9.9720393,
    "lng": 98.6400885
  },
  "ชุมพร": {
    "lat": 10.497836,
    "lng": 99.1788304
  },
  "สงขลา": {
    "lat": 7.1100606,
    "lng": 100.6309169
  },
  "สตูล": {
    "lat": 6.7117369,
    "lng": 99.9688636
  },
  "ตรัง": {
    "lat": 7.5593592,
    "lng": 99.6109944
  },
  "พัทลุง": {
    "lat": 7.6166932,
    "lng": 100.074051
  },
  "ปัตตานี": {
    "lat": 6.8626351,
    "lng": 101.2637155
  },
  "ยะลา": {
    "lat": 6.5411376,
    "lng": 101.280396
  },
  "นราธิวาส": {
    "lat": 6.427987,
    "lng": 101.82259
  }
};

export const districtCoordinates: { [key: string]: Coordinates } = {
  "กรุงเทพมหานคร|พระนคร": {
    "lat": 13.7560243,
    "lng": 100.4986793
  },
  "กรุงเทพมหานคร|ดุสิต": {
    "lat": 13.7726943,
    "lng": 100.5099262
  },
  "กรุงเทพมหานคร|หนองจอก": {
    "lat": 13.8559883,
    "lng": 100.8619689
  },
  "กรุงเทพมหานคร|บางรัก": {
    "lat": 13.7262395,
    "lng": 100.5267991
  },
  "กรุงเทพมหานคร|บางเขน": {
    "lat": 13.864387,
    "lng": 100.6146434
  },
  "กรุงเทพมหานคร|บางกะปิ": {
    "lat": 13.7650282,
    "lng": 100.6473885
  },
  "กรุงเทพมหานคร|ปทุมวัน": {
    "lat": 13.7401666,
    "lng": 100.5352367
  },
  "กรุงเทพมหานคร|ป้อมปราบศัตรูพ่าย": {
    "lat": 13.7514954,
    "lng": 100.5108479
  },
  "กรุงเทพมหานคร|พระโขนง": {
    "lat": 13.6910654,
    "lng": 100.614025
  },
  "กรุงเทพมหานคร|มีนบุรี": {
    "lat": 13.8130488,
    "lng": 100.731339
  },
  "กรุงเทพมหานคร|ลาดกระบัง": {
    "lat": 13.7277339,
    "lng": 100.7486314
  },
  "กรุงเทพมหานคร|ยานนาวา": {
    "lat": 13.7171256,
    "lng": 100.5151327
  },
  "กรุงเทพมหานคร|สัมพันธวงศ์": {
    "lat": 13.7380091,
    "lng": 100.5098502
  },
  "กรุงเทพมหานคร|พญาไท": {
    "lat": 13.7568078,
    "lng": 100.5337793
  },
  "กรุงเทพมหานคร|ธนบุรี": {
    "lat": 13.7164911,
    "lng": 100.4874338
  },
  "กรุงเทพมหานคร|บางกอกใหญ่": {
    "lat": 13.7320727,
    "lng": 100.4814589
  },
  "กรุงเทพมหานคร|ห้วยขวาง": {
    "lat": 13.7790391,
    "lng": 100.5739529
  },
  "กรุงเทพมหานคร|คลองสาน": {
    "lat": 13.7279708,
    "lng": 100.5087902
  },
  "กรุงเทพมหานคร|ตลิ่งชัน": {
    "lat": 13.7733179,
    "lng": 100.4284178
  },
  "กรุงเทพมหานคร|บางกอกน้อย": {
    "lat": 13.7604091,
    "lng": 100.471573
  },
  "กรุงเทพมหานคร|บางขุนเทียน": {
    "lat": 13.5995816,
    "lng": 100.4331316
  },
  "กรุงเทพมหานคร|ภาษีเจริญ": {
    "lat": 13.7207491,
    "lng": 100.4577015
  },
  "กรุงเทพมหานคร|หนองแขม": {
    "lat": 13.7207491,
    "lng": 100.4577015
  },
  "กรุงเทพมหานคร|ราษฎร์บูรณะ": {
    "lat": 13.6812411,
    "lng": 100.5037003
  },
  "กรุงเทพมหานคร|บางพลัด": {
    "lat": 13.7919952,
    "lng": 100.5004335
  },
  "กรุงเทพมหานคร|ดินแดง": {
    "lat": 13.7630761,
    "lng": 100.5433408
  },
  "กรุงเทพมหานคร|บึงกุ่ม": {
    "lat": 13.8038957,
    "lng": 100.647812
  },
  "กรุงเทพมหานคร|สาทร": {
    "lat": 13.6937454,
    "lng": 100.510007
  },
  "กรุงเทพมหานคร|บางซื่อ": {
    "lat": 13.803181,
    "lng": 100.5393292
  },
  "กรุงเทพมหานคร|จตุจักร": {
    "lat": 13.8037421,
    "lng": 100.5546027
  },
  "กรุงเทพมหานคร|บางคอแหลม": {
    "lat": 13.6954096,
    "lng": 100.5127381
  },
  "กรุงเทพมหานคร|ประเวศ": {
    "lat": 13.693295,
    "lng": 100.645971
  },
  "กรุงเทพมหานคร|คลองเตย": {
    "lat": 13.7225158,
    "lng": 100.5540678
  },
  "กรุงเทพมหานคร|สวนหลวง": {
    "lat": 13.7194781,
    "lng": 100.6129534
  },
  "กรุงเทพมหานคร|จอมทอง": {
    "lat": 13.6955177,
    "lng": 100.4453018
  },
  "กรุงเทพมหานคร|ดอนเมือง": {
    "lat": 13.9245384,
    "lng": 100.6038701
  },
  "กรุงเทพมหานคร|ราชเทวี": {
    "lat": 13.7516381,
    "lng": 100.5315687
  },
  "กรุงเทพมหานคร|ลาดพร้าว": {
    "lat": 13.8289265,
    "lng": 100.5943624
  },
  "กรุงเทพมหานคร|วัฒนา": {
    "lat": 13.7398583,
    "lng": 100.5594458
  },
  "กรุงเทพมหานคร|บางแค": {
    "lat": 13.6988894,
    "lng": 100.4210604
  },
  "กรุงเทพมหานคร|หลักสี่": {
    "lat": 13.8841935,
    "lng": 100.5774799
  },
  "กรุงเทพมหานคร|สายไหม": {
    "lat": 13.9213159,
    "lng": 100.683202
  },
  "กรุงเทพมหานคร|คันนายาว": {
    "lat": 13.793899,
    "lng": 100.692192
  },
  "กรุงเทพมหานคร|สะพานสูง": {
    "lat": 13.7676357,
    "lng": 100.6928804
  },
  "กรุงเทพมหานคร|วังทองหลาง": {
    "lat": 13.7802488,
    "lng": 100.5999507
  },
  "กรุงเทพมหานคร|คลองสามวา": {
    "lat": 13.8381942,
    "lng": 100.7295908
  },
  "กรุงเทพมหานคร|บางนา": {
    "lat": 13.6682906,
    "lng": 100.6048034
  },
  "กรุงเทพมหานคร|ทวีวัฒนา": {
    "lat": 13.7648929,
    "lng": 100.3343991
  },
  "กรุงเทพมหานคร|ทุ่งครุ": {
    "lat": 13.6191708,
    "lng": 100.5103542
  },
  "กรุงเทพมหานคร|บางบอน": {
    "lat": 13.6670215,
    "lng": 100.4036861
  },
  "สมุทรปราการ|เมืองสมุทรปราการ": {
    "lat": 13.6213747,
    "lng": 100.5992148
  },
  "สมุทรปราการ|บางบ่อ": {
    "lat": 13.6058169,
    "lng": 100.8677256
  },
  "สมุทรปราการ|บางพลี": {
    "lat": 13.6299818,
    "lng": 100.6400175
  },
  "สมุทรปราการ|พระประแดง": {
    "lat": 13.6532561,
    "lng": 100.5633676
  },
  "สมุทรปราการ|พระสมุทรเจดีย์": {
    "lat": 13.5737973,
    "lng": 100.5521142
  },
  "สมุทรปราการ|บางเสาธง": {
    "lat": 13.6132538,
    "lng": 100.8282161
  },
  "นนทบุรี|เมืองนนทบุรี": {
    "lat": 13.8658492,
    "lng": 100.4941285
  },
  "นนทบุรี|บางกรวย": {
    "lat": 13.8068972,
    "lng": 100.4624937
  },
  "นนทบุรี|บางใหญ่": {
    "lat": 13.8445656,
    "lng": 100.3806992
  },
  "นนทบุรี|บางบัวทอง": {
    "lat": 13.9446573,
    "lng": 100.4308137
  },
  "นนทบุรี|ไทรน้อย": {
    "lat": 13.9832139,
    "lng": 100.3385624
  },
  "นนทบุรี|ปากเกร็ด": {
    "lat": 13.9154022,
    "lng": 100.4948197
  },
  "ปทุมธานี|เมืองปทุมธานี": {
    "lat": 13.9854373,
    "lng": 100.5521142
  },
  "ปทุมธานี|คลองหลวง": {
    "lat": 14.0044429,
    "lng": 100.6179542
  },
  "ปทุมธานี|ธัญบุรี": {
    "lat": 13.970533,
    "lng": 100.6309169
  },
  "ปทุมธานี|หนองเสือ": {
    "lat": 14.1785783,
    "lng": 100.8451467
  },
  "ปทุมธานี|ลาดหลุมแก้ว": {
    "lat": 14.0032361,
    "lng": 100.4059456
  },
  "ปทุมธานี|ลำลูกกา": {
    "lat": 13.970533,
    "lng": 100.6309169
  },
  "ปทุมธานี|สามโคก": {
    "lat": 14.0758882,
    "lng": 100.5208569
  },
  "พระนครศรีอยุธยา|พระนครศรีอยุธยา": {
    "lat": 14.3523939,
    "lng": 100.5521142
  },
  "พระนครศรีอยุธยา|ท่าเรือ": {
    "lat": 14.5599975,
    "lng": 100.7238776
  },
  "พระนครศรีอยุธยา|นครหลวง": {
    "lat": 14.4759803,
    "lng": 100.6241192
  },
  "พระนครศรีอยุธยา|บางไทร": {
    "lat": 14.2186448,
    "lng": 100.4621366
  },
  "พระนครศรีอยุธยา|บางบาล": {
    "lat": 14.4023507,
    "lng": 100.4621366
  },
  "พระนครศรีอยุธยา|บางปะอิน": {
    "lat": 14.2121868,
    "lng": 100.6045199
  },
  "พระนครศรีอยุธยา|บางปะหัน": {
    "lat": 14.4792629,
    "lng": 100.5408622
  },
  "พระนครศรีอยุธยา|ผักไห่": {
    "lat": 14.4403155,
    "lng": 100.383479
  },
  "พระนครศรีอยุธยา|ภาชี": {
    "lat": 14.4477589,
    "lng": 100.724572
  },
  "พระนครศรีอยุธยา|ลาดบัวหลวง": {
    "lat": 14.1766793,
    "lng": 100.3722477
  },
  "พระนครศรีอยุธยา|วังน้อย": {
    "lat": 14.2262517,
    "lng": 100.7272992
  },
  "พระนครศรีอยุธยา|เสนา": {
    "lat": 14.3144265,
    "lng": 100.3722477
  },
  "พระนครศรีอยุธยา|บางซ้าย": {
    "lat": 14.371666,
    "lng": 100.314818
  },
  "พระนครศรีอยุธยา|อุทัย": {
    "lat": 14.3618606,
    "lng": 100.6685901
  },
  "พระนครศรีอยุธยา|มหาราช": {
    "lat": 14.5822246,
    "lng": 100.5521142
  },
  "พระนครศรีอยุธยา|บ้านแพรก": {
    "lat": 14.6456948,
    "lng": 100.5770655
  },
  "อ่างทอง|เมืองอ่างทอง": {
    "lat": 14.5895914,
    "lng": 100.4550554
  },
  "อ่างทอง|ไชโย": {
    "lat": 14.7147825,
    "lng": 100.4358163
  },
  "อ่างทอง|ป่าโมก": {
    "lat": 14.4980456,
    "lng": 100.4424658
  },
  "อ่างทอง|โพธิ์ทอง": {
    "lat": 14.6823992,
    "lng": 100.3722477
  },
  "อ่างทอง|แสวงหา": {
    "lat": 14.7600313,
    "lng": 100.310501
  },
  "อ่างทอง|วิเศษชัยชาญ": {
    "lat": 14.5462949,
    "lng": 100.3273368
  },
  "อ่างทอง|สามโก้": {
    "lat": 14.6013032,
    "lng": 100.2544044
  },
  "ลพบุรี|เมืองลพบุรี": {
    "lat": 14.7996306,
    "lng": 100.6343005
  },
  "ลพบุรี|พัฒนานิคม": {
    "lat": 14.8889139,
    "lng": 100.9668767
  },
  "ลพบุรี|โคกสำโรง": {
    "lat": 15.067666,
    "lng": 100.7217139
  },
  "ลพบุรี|ชัยบาดาล": {
    "lat": 15.2074763,
    "lng": 101.136733
  },
  "ลพบุรี|ท่าวุ้ง": {
    "lat": 14.8144809,
    "lng": 100.5071143
  },
  "ลพบุรี|บ้านหมี่": {
    "lat": 15.089097,
    "lng": 100.5521142
  },
  "ลพบุรี|ท่าหลวง": {
    "lat": 15.071815,
    "lng": 101.1504111
  },
  "ลพบุรี|สระโบสถ์": {
    "lat": 15.2245864,
    "lng": 100.8564355
  },
  "ลพบุรี|โคกเจริญ": {
    "lat": 15.3944421,
    "lng": 100.7754207
  },
  "ลพบุรี|ลำสนธิ": {
    "lat": 15.3854608,
    "lng": 101.3317605
  },
  "ลพบุรี|หนองม่วง": {
    "lat": 15.2256001,
    "lng": 100.6600016
  },
  "สิงห์บุรี|เมืองสิงห์บุรี": {
    "lat": 14.8997786,
    "lng": 100.4059456
  },
  "สิงห์บุรี|บางระจัน": {
    "lat": 14.9169141,
    "lng": 100.2824483
  },
  "สิงห์บุรี|ค่ายบางระจัน": {
    "lat": 14.8126417,
    "lng": 100.2936683
  },
  "สิงห์บุรี|พรหมบุรี": {
    "lat": 14.7824909,
    "lng": 100.4508956
  },
  "สิงห์บุรี|ท่าช้าง": {
    "lat": 14.7794841,
    "lng": 100.3891641
  },
  "สิงห์บุรี|อินทร์บุรี": {
    "lat": 15.0011448,
    "lng": 100.3329494
  },
  "ชัยนาท|เมืองชัยนาท": {
    "lat": 15.1252422,
    "lng": 100.1423172
  },
  "ชัยนาท|มโนรมย์": {
    "lat": 15.3388555,
    "lng": 100.1479182
  },
  "ชัยนาท|วัดสิงห์": {
    "lat": 15.2617924,
    "lng": 100.0431355
  },
  "ชัยนาท|สรรพยา": {
    "lat": 15.1327349,
    "lng": 100.2319757
  },
  "ชัยนาท|สรรคบุรี": {
    "lat": 15.0152766,
    "lng": 100.1479182
  },
  "ชัยนาท|หันคา": {
    "lat": 15.0101985,
    "lng": 100.0024084
  },
  "ชัยนาท|หนองมะโมง": {
    "lat": 15.2049356,
    "lng": 99.7790227
  },
  "ชัยนาท|เนินขาม": {
    "lat": 14.9679283,
    "lng": 99.9129845
  },
  "สระบุรี|เมืองสระบุรี": {
    "lat": 14.5288823,
    "lng": 100.9101032
  },
  "สระบุรี|แก่งคอย": {
    "lat": 14.5801157,
    "lng": 101.003522
  },
  "สระบุรี|หนองแค": {
    "lat": 14.3380654,
    "lng": 100.8677256
  },
  "สระบุรี|วิหารแดง": {
    "lat": 14.3153708,
    "lng": 100.9863525
  },
  "สระบุรี|หนองแซง": {
    "lat": 14.4898955,
    "lng": 100.8112885
  },
  "สระบุรี|บ้านหมอ": {
    "lat": 14.614994,
    "lng": 100.7154228
  },
  "สระบุรี|ดอนพุด": {
    "lat": 14.5961403,
    "lng": 100.6252859
  },
  "สระบุรี|หนองโดน": {
    "lat": 14.6790319,
    "lng": 100.6985155
  },
  "สระบุรี|พระพุทธบาท": {
    "lat": 14.7268634,
    "lng": 100.7830826
  },
  "สระบุรี|เสาไห้": {
    "lat": 14.5367501,
    "lng": 100.8536132
  },
  "สระบุรี|มวกเหล็ก": {
    "lat": 14.4608673,
    "lng": 101.1843887
  },
  "สระบุรี|วังม่วง": {
    "lat": 14.874441,
    "lng": 101.1843887
  },
  "สระบุรี|เฉลิมพระเกียรติ": {
    "lat": 14.5224885,
    "lng": 100.9139619
  },
  "ชลบุรี|เมืองชลบุรี": {
    "lat": 13.3909924,
    "lng": 101.0122861
  },
  "ชลบุรี|บ้านบึง": {
    "lat": 13.3104674,
    "lng": 101.1257083
  },
  "ชลบุรี|หนองใหญ่": {
    "lat": 12.951029,
    "lng": 100.9111545
  },
  "ชลบุรี|บางละมุง": {
    "lat": 12.9173831,
    "lng": 101.0033112
  },
  "ชลบุรี|พานทอง": {
    "lat": 13.4743811,
    "lng": 101.0878684
  },
  "ชลบุรี|พนัสนิคม": {
    "lat": 13.4522814,
    "lng": 101.1815568
  },
  "ชลบุรี|ศรีราชา": {
    "lat": 13.1641308,
    "lng": 100.9216588
  },
  "ชลบุรี|เกาะสีชัง": {
    "lat": 13.1499153,
    "lng": 100.8084675
  },
  "ชลบุรี|สัตหีบ": {
    "lat": 12.6836578,
    "lng": 100.901604
  },
  "ชลบุรี|บ่อทอง": {
    "lat": 13.1838889,
    "lng": 101.4908333
  },
  "ชลบุรี|เกาะจันทร์": {
    "lat": 13.3912957,
    "lng": 101.3199255
  },
  "ระยอง|เมืองระยอง": {
    "lat": 12.6754092,
    "lng": 101.3658004
  },
  "ระยอง|บ้านฉาง": {
    "lat": 12.7341552,
    "lng": 101.048549
  },
  "ระยอง|แกลง": {
    "lat": 12.7797397,
    "lng": 101.6490959
  },
  "ระยอง|วังจันทร์": {
    "lat": 12.9310911,
    "lng": 101.5198329
  },
  "ระยอง|บ้านค่าย": {
    "lat": 12.7855768,
    "lng": 101.3034028
  },
  "ระยอง|ปลวกแดง": {
    "lat": 12.9707642,
    "lng": 101.2163774
  },
  "ระยอง|เขาชะเมา": {
    "lat": 12.96,
    "lng": 101.7383333
  },
  "ระยอง|นิคมพัฒนา": {
    "lat": 12.8308102,
    "lng": 101.1730615
  },
  "จันทบุรี|เมืองจันทบุรี": {
    "lat": 12.6112485,
    "lng": 102.1037806
  },
  "จันทบุรี|ขลุง": {
    "lat": 12.4537943,
    "lng": 102.2290442
  },
  "จันทบุรี|ท่าใหม่": {
    "lat": 12.647214,
    "lng": 102.0032957
  },
  "จันทบุรี|โป่งน้ำร้อน": {
    "lat": 12.9628371,
    "lng": 102.4934904
  },
  "จันทบุรี|มะขาม": {
    "lat": 12.6575,
    "lng": 102.1969444
  },
  "จันทบุรี|แหลมสิงห์": {
    "lat": 12.4680818,
    "lng": 102.100396
  },
  "จันทบุรี|สอยดาว": {
    "lat": 13.06,
    "lng": 102.1555556
  },
  "จันทบุรี|แก่งหางแมว": {
    "lat": 12.9678205,
    "lng": 101.9119871
  },
  "จันทบุรี|นายายอาม": {
    "lat": 12.7781601,
    "lng": 101.8549588
  },
  "จันทบุรี|เขาคิชฌกูฏ": {
    "lat": 12.8497222,
    "lng": 102.1697222
  },
  "ตราด|เมืองตราด": {
    "lat": 12.2427059,
    "lng": 102.5174726
  },
  "ตราด|คลองใหญ่": {
    "lat": 11.7786113,
    "lng": 102.8882438
  },
  "ตราด|เขาสมิง": {
    "lat": 12.345,
    "lng": 102.4536111
  },
  "ตราด|บ่อไร่": {
    "lat": 12.5766509,
    "lng": 102.5527505
  },
  "ตราด|แหลมงอบ": {
    "lat": 12.1783502,
    "lng": 102.3996973
  },
  "ตราด|เกาะกูด": {
    "lat": 11.6680759,
    "lng": 102.5642261
  },
  "ตราด|เกาะช้าง": {
    "lat": 12.0479159,
    "lng": 102.3234816
  },
  "ฉะเชิงเทรา|เมืองฉะเชิงเทรา": {
    "lat": 13.6592703,
    "lng": 101.0717963
  },
  "ฉะเชิงเทรา|บางคล้า": {
    "lat": 13.723331,
    "lng": 101.2066116
  },
  "ฉะเชิงเทรา|บางน้ำเปรี้ยว": {
    "lat": 13.871792,
    "lng": 101.048549
  },
  "ฉะเชิงเทรา|บางปะกง": {
    "lat": 13.4987164,
    "lng": 100.9693968
  },
  "ฉะเชิงเทรา|บ้านโพธิ์": {
    "lat": 13.5957905,
    "lng": 101.0938079
  },
  "ฉะเชิงเทรา|พนมสารคาม": {
    "lat": 13.7496342,
    "lng": 101.3410688
  },
  "ฉะเชิงเทรา|ราชสาส์น": {
    "lat": 13.7809557,
    "lng": 101.286392
  },
  "ฉะเชิงเทรา|สนามชัยเขต": {
    "lat": 13.6581446,
    "lng": 101.4381602
  },
  "ฉะเชิงเทรา|แปลงยาว": {
    "lat": 13.6068853,
    "lng": 101.2493924
  },
  "ฉะเชิงเทรา|ท่าตะเกียบ": {
    "lat": 13.4754941,
    "lng": 101.7296049
  },
  "ฉะเชิงเทรา|คลองเขื่อน": {
    "lat": 13.780713,
    "lng": 101.1673984
  },
  "ปราจีนบุรี|เมืองปราจีนบุรี": {
    "lat": 14.0552548,
    "lng": 101.3784849
  },
  "ปราจีนบุรี|กบินทร์บุรี": {
    "lat": 14.0650764,
    "lng": 101.834905
  },
  "ปราจีนบุรี|นาดี": {
    "lat": 14.2030447,
    "lng": 101.7751709
  },
  "ปราจีนบุรี|บ้านสร้าง": {
    "lat": 14.0065988,
    "lng": 101.2240441
  },
  "ปราจีนบุรี|ประจันตคาม": {
    "lat": 14.0508866,
    "lng": 101.4963935
  },
  "ปราจีนบุรี|ศรีมหาโพธิ": {
    "lat": 13.8964152,
    "lng": 101.5020752
  },
  "ปราจีนบุรี|ศรีมโหสถ": {
    "lat": 13.8320366,
    "lng": 101.4561219
  },
  "นครนายก|เมืองนครนายก": {
    "lat": 14.2038387,
    "lng": 101.2268773
  },
  "นครนายก|ปากพลี": {
    "lat": 14.1063403,
    "lng": 101.2920619
  },
  "นครนายก|บ้านนา": {
    "lat": 14.2613322,
    "lng": 101.0697615
  },
  "นครนายก|องครักษ์": {
    "lat": 14.0971575,
    "lng": 100.997658
  },
  "สระแก้ว|เมืองสระแก้ว": {
    "lat": 13.8240407,
    "lng": 102.0645821
  },
  "สระแก้ว|คลองหาด": {
    "lat": 13.448373,
    "lng": 102.3070208
  },
  "สระแก้ว|ตาพระยา": {
    "lat": 14.1115298,
    "lng": 102.589708
  },
  "สระแก้ว|วังน้ำเย็น": {
    "lat": 13.5034908,
    "lng": 102.0946818
  },
  "สระแก้ว|วัฒนานคร": {
    "lat": 13.7303147,
    "lng": 102.334934
  },
  "สระแก้ว|อรัญประเทศ": {
    "lat": 13.7479007,
    "lng": 102.5203939
  },
  "สระแก้ว|เขาฉกรรจ์": {
    "lat": 13.8240407,
    "lng": 102.0645821
  },
  "สระแก้ว|โคกสูง": {
    "lat": 13.8151696,
    "lng": 102.7003989
  },
  "สระแก้ว|วังสมบูรณ์": {
    "lat": 13.3152042,
    "lng": 102.2319048
  },
  "นครราชสีมา|เมืองนครราชสีมา": {
    "lat": 14.9415189,
    "lng": 102.1175404
  },
  "นครราชสีมา|ครบุรี": {
    "lat": 14.5866835,
    "lng": 102.1061105
  },
  "นครราชสีมา|เสิงสาง": {
    "lat": 14.3723113,
    "lng": 102.4839212
  },
  "นครราชสีมา|คง": {
    "lat": 15.4129378,
    "lng": 102.3234816
  },
  "นครราชสีมา|บ้านเหลื่อม": {
    "lat": 15.6195755,
    "lng": 102.1289715
  },
  "นครราชสีมา|จักราช": {
    "lat": 15.026754,
    "lng": 102.4495221
  },
  "นครราชสีมา|โชคชัย": {
    "lat": 14.72328,
    "lng": 102.1609718
  },
  "นครราชสีมา|ด่านขุนทด": {
    "lat": 15.1786657,
    "lng": 101.7637775
  },
  "นครราชสีมา|โนนไทย": {
    "lat": 15.2088556,
    "lng": 102.060403
  },
  "นครราชสีมา|โนนสูง": {
    "lat": 15.2072285,
    "lng": 102.3005803
  },
  "นครราชสีมา|ขามสะแกแสง": {
    "lat": 15.3575998,
    "lng": 102.1804261
  },
  "นครราชสีมา|บัวใหญ่": {
    "lat": 15.5835978,
    "lng": 102.4253001
  },
  "นครราชสีมา|ประทาย": {
    "lat": 15.5334573,
    "lng": 102.7307497
  },
  "นครราชสีมา|ปักธงชัย": {
    "lat": 14.786474,
    "lng": 102.0438378
  },
  "นครราชสีมา|พิมาย": {
    "lat": 15.1970346,
    "lng": 102.4839212
  },
  "นครราชสีมา|ห้วยแถลง": {
    "lat": 14.989289,
    "lng": 102.7003451
  },
  "นครราชสีมา|ชุมพวง": {
    "lat": 15.3500317,
    "lng": 102.742295
  },
  "นครราชสีมา|สูงเนิน": {
    "lat": 14.8704596,
    "lng": 101.8322677
  },
  "นครราชสีมา|ขามทะเลสอ": {
    "lat": 14.9608979,
    "lng": 101.9690458
  },
  "นครราชสีมา|สีคิ้ว": {
    "lat": 14.9919687,
    "lng": 101.5930268
  },
  "นครราชสีมา|ปากช่อง": {
    "lat": 14.7275612,
    "lng": 101.3658004
  },
  "นครราชสีมา|หนองบุญมาก": {
    "lat": 14.7358946,
    "lng": 102.3937099
  },
  "นครราชสีมา|แก้งสนามนาง": {
    "lat": 15.7271335,
    "lng": 102.2662372
  },
  "นครราชสีมา|โนนแดง": {
    "lat": 15.4121381,
    "lng": 102.5412761
  },
  "นครราชสีมา|วังน้ำเขียว": {
    "lat": 14.4364486,
    "lng": 101.6840589
  },
  "นครราชสีมา|เทพารักษ์": {
    "lat": 15.2729261,
    "lng": 101.5020752
  },
  "นครราชสีมา|เมืองยาง": {
    "lat": 15.2227739,
    "lng": 102.8263206
  },
  "นครราชสีมา|พระทองคำ": {
    "lat": 15.3708926,
    "lng": 101.9831805
  },
  "นครราชสีมา|ลำทะเมนชัย": {
    "lat": 15.2868802,
    "lng": 102.9205295
  },
  "นครราชสีมา|บัวลาย": {
    "lat": 15.6462253,
    "lng": 102.4724537
  },
  "นครราชสีมา|สีดา": {
    "lat": 15.5718701,
    "lng": 102.5642261
  },
  "นครราชสีมา|เฉลิมพระเกียรติ": {
    "lat": 15.0017506,
    "lng": 102.2776838
  },
  "บุรีรัมย์|เมืองบุรีรัมย์": {
    "lat": 14.8905684,
    "lng": 103.035694
  },
  "บุรีรัมย์|คูเมือง": {
    "lat": 15.3273836,
    "lng": 103.0126523
  },
  "บุรีรัมย์|กระสัง": {
    "lat": 14.9094632,
    "lng": 103.3009828
  },
  "บุรีรัมย์|นางรอง": {
    "lat": 15.2427118,
    "lng": 103.0081326
  },
  "บุรีรัมย์|หนองกี่": {
    "lat": 14.7332797,
    "lng": 102.5757028
  },
  "บุรีรัมย์|ละหานทราย": {
    "lat": 14.4196566,
    "lng": 102.8744945
  },
  "บุรีรัมย์|ประโคนชัย": {
    "lat": 14.6014909,
    "lng": 103.0933171
  },
  "บุรีรัมย์|บ้านกรวด": {
    "lat": 14.4356818,
    "lng": 103.0990809
  },
  "บุรีรัมย์|พุทไธสง": {
    "lat": 15.4910959,
    "lng": 102.9974351
  },
  "บุรีรัมย์|ลำปลายมาศ": {
    "lat": 15.0281466,
    "lng": 102.8458197
  },
  "บุรีรัมย์|สตึก": {
    "lat": 15.3003013,
    "lng": 103.2948473
  },
  "บุรีรัมย์|ปะคำ": {
    "lat": 14.4322181,
    "lng": 102.644587
  },
  "บุรีรัมย์|นาโพธิ์": {
    "lat": 15.6408669,
    "lng": 102.9346988
  },
  "บุรีรัมย์|หนองหงส์": {
    "lat": 14.8898061,
    "lng": 102.644587
  },
  "บุรีรัมย์|พลับพลาชัย": {
    "lat": 14.7238528,
    "lng": 103.1509672
  },
  "บุรีรัมย์|ห้วยราช": {
    "lat": 14.9765027,
    "lng": 103.1828685
  },
  "บุรีรัมย์|โนนสุวรรณ": {
    "lat": 14.5744185,
    "lng": 102.597852
  },
  "บุรีรัมย์|ชำนิ": {
    "lat": 14.7926661,
    "lng": 102.8457316
  },
  "บุรีรัมย์|บ้านใหม่ไชยพจน์": {
    "lat": 15.5679804,
    "lng": 102.8284772
  },
  "บุรีรัมย์|โนนดินแดง": {
    "lat": 14.3121305,
    "lng": 102.7485673
  },
  "บุรีรัมย์|บ้านด่าน": {
    "lat": 15.1128022,
    "lng": 103.1591164
  },
  "บุรีรัมย์|แคนดง": {
    "lat": 15.3097773,
    "lng": 103.1163739
  },
  "บุรีรัมย์|เฉลิมพระเกียรติ": {
    "lat": 14.5566749,
    "lng": 102.8744945
  },
  "สุรินทร์|เมืองสุรินทร์": {
    "lat": 14.8828674,
    "lng": 103.4937242
  },
  "สุรินทร์|ชุมพลบุรี": {
    "lat": 15.3942217,
    "lng": 103.4280586
  },
  "สุรินทร์|ท่าตูม": {
    "lat": 15.322183,
    "lng": 103.6765709
  },
  "สุรินทร์|จอมพระ": {
    "lat": 15.1538406,
    "lng": 103.6131203
  },
  "สุรินทร์|ปราสาท": {
    "lat": 14.5950082,
    "lng": 103.4049445
  },
  "สุรินทร์|กาบเชิง": {
    "lat": 14.4822976,
    "lng": 103.5784012
  },
  "สุรินทร์|รัตนบุรี": {
    "lat": 15.3196515,
    "lng": 103.8574529
  },
  "สุรินทร์|สนม": {
    "lat": 15.2104948,
    "lng": 103.7581637
  },
  "สุรินทร์|ศีขรภูมิ": {
    "lat": 14.9056012,
    "lng": 103.7452834
  },
  "สุรินทร์|สังขะ": {
    "lat": 14.6707148,
    "lng": 103.8167772
  },
  "สุรินทร์|ลำดวน": {
    "lat": 14.7061887,
    "lng": 103.6478486
  },
  "สุรินทร์|สำโรงทาบ": {
    "lat": 14.9860058,
    "lng": 103.9260001
  },
  "สุรินทร์|บัวเชด": {
    "lat": 14.5285939,
    "lng": 103.9492051
  },
  "สุรินทร์|พนมดงรัก": {
    "lat": 14.4178959,
    "lng": 103.3125299
  },
  "สุรินทร์|ศรีณรงค์": {
    "lat": 14.7713501,
    "lng": 103.8911999
  },
  "สุรินทร์|เขวาสินรินทร์": {
    "lat": 15.0072693,
    "lng": 103.5784012
  },
  "สุรินทร์|โนนนารายณ์": {
    "lat": 15.1824034,
    "lng": 103.8911999
  },
  "ศรีสะเกษ|เมืองศรีสะเกษ": {
    "lat": 15.1170086,
    "lng": 104.3274123
  },
  "ศรีสะเกษ|ยางชุมน้อย": {
    "lat": 15.241178,
    "lng": 104.4024704
  },
  "ศรีสะเกษ|กันทรารมย์": {
    "lat": 15.1274943,
    "lng": 104.5757366
  },
  "ศรีสะเกษ|กันทรลักษ์": {
    "lat": 14.6066438,
    "lng": 104.705431
  },
  "ศรีสะเกษ|ขุขันธ์": {
    "lat": 14.6417626,
    "lng": 104.1466046
  },
  "ศรีสะเกษ|ไพรบึง": {
    "lat": 14.7531969,
    "lng": 104.367553
  },
  "ศรีสะเกษ|ปรางค์กู่": {
    "lat": 14.8297769,
    "lng": 104.053676
  },
  "ศรีสะเกษ|ขุนหาญ": {
    "lat": 14.5334509,
    "lng": 104.4257533
  },
  "ศรีสะเกษ|ราษีไศล": {
    "lat": 15.3445135,
    "lng": 104.1560983
  },
  "ศรีสะเกษ|อุทุมพรพิสัย": {
    "lat": 15.0977748,
    "lng": 104.1466046
  },
  "ศรีสะเกษ|บึงบูรพ์": {
    "lat": 15.3261466,
    "lng": 104.0594822
  },
  "ศรีสะเกษ|ห้วยทับทัน": {
    "lat": 14.9909258,
    "lng": 104.0304535
  },
  "ศรีสะเกษ|โนนคูณ": {
    "lat": 14.9037704,
    "lng": 104.6821048
  },
  "ศรีสะเกษ|ศรีรัตนะ": {
    "lat": 14.8247444,
    "lng": 104.4956239
  },
  "ศรีสะเกษ|น้ำเกลี้ยง": {
    "lat": 14.9234729,
    "lng": 104.5538744
  },
  "ศรีสะเกษ|วังหิน": {
    "lat": 14.9792432,
    "lng": 104.2163411
  },
  "ศรีสะเกษ|ภูสิงห์": {
    "lat": 14.5488299,
    "lng": 104.1378195
  },
  "ศรีสะเกษ|เมืองจันทร์": {
    "lat": 15.1558333,
    "lng": 104.0272222
  },
  "ศรีสะเกษ|เบญจลักษ์": {
    "lat": 14.8097174,
    "lng": 104.7287607
  },
  "ศรีสะเกษ|พยุห์": {
    "lat": 14.9218093,
    "lng": 104.4024704
  },
  "ศรีสะเกษ|โพธิ์ศรีสุวรรณ": {
    "lat": 15.2285929,
    "lng": 104.0652887
  },
  "ศรีสะเกษ|ศิลาลาด": {
    "lat": 15.478746,
    "lng": 104.088517
  },
  "อุบลราชธานี|เมืองอุบลราชธานี": {
    "lat": 15.2286712,
    "lng": 104.8564472
  },
  "อุบลราชธานี|ศรีเมืองใหม่": {
    "lat": 15.5639458,
    "lng": 105.3599568
  },
  "อุบลราชธานี|โขงเจียม": {
    "lat": 15.4383436,
    "lng": 105.5239912
  },
  "อุบลราชธานี|เขื่องใน": {
    "lat": 15.4113503,
    "lng": 104.5467528
  },
  "อุบลราชธานี|เขมราฐ": {
    "lat": 15.8923683,
    "lng": 105.1858696
  },
  "อุบลราชธานี|เดชอุดม": {
    "lat": 14.8548457,
    "lng": 105.0791228
  },
  "อุบลราชธานี|นาจะหลวย": {
    "lat": 14.503619,
    "lng": 105.2428853
  },
  "อุบลราชธานี|น้ำยืน": {
    "lat": 14.4010715,
    "lng": 105.0791228
  },
  "อุบลราชธานี|บุณฑริก": {
    "lat": 14.7451613,
    "lng": 105.3599568
  },
  "อุบลราชธานี|ตระการพืชผล": {
    "lat": 15.5837056,
    "lng": 105.0791228
  },
  "อุบลราชธานี|กุดข้าวปุ้น": {
    "lat": 15.8366515,
    "lng": 105.0557415
  },
  "อุบลราชธานี|ม่วงสามสิบ": {
    "lat": 15.5058041,
    "lng": 104.7170954
  },
  "อุบลราชธานี|วารินชำราบ": {
    "lat": 15.1997052,
    "lng": 104.8571368
  },
  "อุบลราชธานี|พิบูลมังสาหาร": {
    "lat": 15.2474826,
    "lng": 105.2320501
  },
  "อุบลราชธานี|ตาลสุม": {
    "lat": 15.3226604,
    "lng": 105.1434387
  },
  "อุบลราชธานี|โพธิ์ไทร": {
    "lat": 15.8464444,
    "lng": 105.2799215
  },
  "อุบลราชธานี|สำโรง": {
    "lat": 15.0221073,
    "lng": 104.7871004
  },
  "อุบลราชธานี|ดอนมดแดง": {
    "lat": 15.2905556,
    "lng": 105.0525
  },
  "อุบลราชธานี|สิรินธร": {
    "lat": 15.0947394,
    "lng": 105.3950939
  },
  "อุบลราชธานี|ทุ่งศรีอุดม": {
    "lat": 14.7520587,
    "lng": 104.9155243
  },
  "อุบลราชธานี|นาเยีย": {
    "lat": 15.0230007,
    "lng": 105.1142011
  },
  "อุบลราชธานี|นาตาล": {
    "lat": 15.8991237,
    "lng": 105.3014109
  },
  "อุบลราชธานี|เหล่าเสือโก้ก": {
    "lat": 15.4283226,
    "lng": 104.9330448
  },
  "อุบลราชธานี|สว่างวีระวงศ์": {
    "lat": 15.2432339,
    "lng": 105.0557415
  },
  "อุบลราชธานี|น้ำขุ่น": {
    "lat": 14.5946094,
    "lng": 104.8921668
  },
  "ยโสธร|เมืองยโสธร": {
    "lat": 15.7983959,
    "lng": 104.1495096
  },
  "ยโสธร|ทรายมูล": {
    "lat": 15.9753775,
    "lng": 104.204716
  },
  "ยโสธร|กุดชุม": {
    "lat": 16.0577566,
    "lng": 104.3442794
  },
  "ยโสธร|คำเขื่อนแก้ว": {
    "lat": 15.6551836,
    "lng": 104.3073234
  },
  "ยโสธร|ป่าติ้ว": {
    "lat": 15.8359591,
    "lng": 104.4024704
  },
  "ยโสธร|มหาชนะชัย": {
    "lat": 15.5246282,
    "lng": 104.262851
  },
  "ยโสธร|ค้อวัง": {
    "lat": 15.3652968,
    "lng": 104.3384616
  },
  "ยโสธร|เลิงนกทา": {
    "lat": 16.171991,
    "lng": 104.5189214
  },
  "ยโสธร|ไทยเจริญ": {
    "lat": 16.0690115,
    "lng": 104.4315746
  },
  "ชัยภูมิ|เมืองชัยภูมิ": {
    "lat": 15.806777,
    "lng": 102.029293
  },
  "ชัยภูมิ|บ้านเขว้า": {
    "lat": 15.7463121,
    "lng": 101.9233964
  },
  "ชัยภูมิ|คอนสวรรค์": {
    "lat": 15.931618,
    "lng": 102.280219
  },
  "ชัยภูมิ|เกษตรสมบูรณ์": {
    "lat": 16.278825,
    "lng": 101.955924
  },
  "ชัยภูมิ|หนองบัวแดง": {
    "lat": 16.082167,
    "lng": 101.803854
  },
  "ชัยภูมิ|จัตุรัส": {
    "lat": 15.566482,
    "lng": 101.850792
  },
  "ชัยภูมิ|บำเหน็จณรงค์": {
    "lat": 15.489515,
    "lng": 101.686803
  },
  "ชัยภูมิ|หนองบัวระเหว": {
    "lat": 15.750667,
    "lng": 101.761933
  },
  "ชัยภูมิ|เทพสถิต": {
    "lat": 15.388782,
    "lng": 101.447052
  },
  "ชัยภูมิ|ภูเขียว": {
    "lat": 16.369183,
    "lng": 102.135346
  },
  "ชัยภูมิ|บ้านแท่น": {
    "lat": 16.405734,
    "lng": 102.343088
  },
  "ชัยภูมิ|แก้งคร้อ": {
    "lat": 16.109125,
    "lng": 102.257517
  },
  "ชัยภูมิ|คอนสาร": {
    "lat": 16.613335,
    "lng": 101.918847
  },
  "ชัยภูมิ|ภักดีชุมพล": {
    "lat": 15.9082,
    "lng": 101.41925
  },
  "ชัยภูมิ|เนินสง่า": {
    "lat": 15.566482,
    "lng": 101.850792
  },
  "ชัยภูมิ|ซับใหญ่": {
    "lat": 15.566482,
    "lng": 101.850792
  },
  "อำนาจเจริญ|เมืองอำนาจเจริญ": {
    "lat": 15.8656422,
    "lng": 104.6257269
  },
  "อำนาจเจริญ|ชานุมาน": {
    "lat": 16.1458061,
    "lng": 104.8921668
  },
  "อำนาจเจริญ|ปทุมราชวงศา": {
    "lat": 15.8924912,
    "lng": 104.9049108
  },
  "อำนาจเจริญ|พนา": {
    "lat": 15.6729405,
    "lng": 104.8629746
  },
  "อำนาจเจริญ|เสนางคนิคม": {
    "lat": 16.0459858,
    "lng": 104.6821048
  },
  "อำนาจเจริญ|หัวตะพาน": {
    "lat": 15.6891238,
    "lng": 104.5422225
  },
  "อำนาจเจริญ|ลืออำนาจ": {
    "lat": 15.7221906,
    "lng": 104.7287607
  },
  "บึงกาฬ|เมืองบึงกาฬ": {
    "lat": 18.3608748,
    "lng": 103.6464504
  },
  "บึงกาฬ|พรเจริญ": {
    "lat": 18.1510352,
    "lng": 103.5736317
  },
  "บึงกาฬ|โซ่พิสัย": {
    "lat": 18.2885872,
    "lng": 103.7969833
  },
  "บึงกาฬ|เซกา": {
    "lat": 17.9897681,
    "lng": 103.9376021
  },
  "บึงกาฬ|ปากคาด": {
    "lat": 18.3264671,
    "lng": 103.3201886
  },
  "บึงกาฬ|บึงโขงหลง": {
    "lat": 18.0152778,
    "lng": 104.0216667
  },
  "บึงกาฬ|ศรีวิไล": {
    "lat": 18.2885872,
    "lng": 103.7969833
  },
  "บึงกาฬ|บุ่งคล้า": {
    "lat": 18.2538823,
    "lng": 103.9724141
  },
  "หนองบัวลำภู|เมืองหนองบัวลำภู": {
    "lat": 17.2218369,
    "lng": 102.4260602
  },
  "หนองบัวลำภู|นากลาง": {
    "lat": 17.2468691,
    "lng": 102.2090224
  },
  "หนองบัวลำภู|โนนสัง": {
    "lat": 16.9485259,
    "lng": 102.5785297
  },
  "หนองบัวลำภู|ศรีบุญเรือง": {
    "lat": 16.9292845,
    "lng": 102.2915983
  },
  "หนองบัวลำภู|สุวรรณคูหา": {
    "lat": 17.5655556,
    "lng": 102.2722222
  },
  "หนองบัวลำภู|นาวัง": {
    "lat": 17.3263608,
    "lng": 102.0489791
  },
  "ขอนแก่น|เมืองขอนแก่น": {
    "lat": 16.4549378,
    "lng": 102.8563594
  },
  "ขอนแก่น|บ้านฝาง": {
    "lat": 16.4504042,
    "lng": 102.6402895
  },
  "ขอนแก่น|พระยืน": {
    "lat": 16.3288881,
    "lng": 102.6331035
  },
  "ขอนแก่น|หนองเรือ": {
    "lat": 16.5154623,
    "lng": 102.4151335
  },
  "ขอนแก่น|ชุมแพ": {
    "lat": 16.5780985,
    "lng": 102.1404037
  },
  "ขอนแก่น|สีชมพู": {
    "lat": 16.8490554,
    "lng": 102.1755941
  },
  "ขอนแก่น|น้ำพอง": {
    "lat": 16.7157136,
    "lng": 102.9205295
  },
  "ขอนแก่น|อุบลรัตน์": {
    "lat": 16.7509121,
    "lng": 102.5412761
  },
  "ขอนแก่น|กระนวน": {
    "lat": 16.6036472,
    "lng": 103.0472164
  },
  "ขอนแก่น|บ้านไผ่": {
    "lat": 16.1169002,
    "lng": 102.7020218
  },
  "ขอนแก่น|เปือยน้อย": {
    "lat": 15.879993,
    "lng": 102.9032643
  },
  "ขอนแก่น|พล": {
    "lat": 15.8117,
    "lng": 102.5986597
  },
  "ขอนแก่น|แวงใหญ่": {
    "lat": 15.911973,
    "lng": 102.4609873
  },
  "ขอนแก่น|แวงน้อย": {
    "lat": 15.822376,
    "lng": 102.4151335
  },
  "ขอนแก่น|หนองสองห้อง": {
    "lat": 15.6979174,
    "lng": 102.7709807
  },
  "ขอนแก่น|ภูเวียง": {
    "lat": 16.6346564,
    "lng": 102.3870095
  },
  "ขอนแก่น|มัญจาคีรี": {
    "lat": 16.2107446,
    "lng": 102.4839212
  },
  "ขอนแก่น|ชนบท": {
    "lat": 16.0791772,
    "lng": 102.5838205
  },
  "ขอนแก่น|เขาสวนกวาง": {
    "lat": 16.9096084,
    "lng": 102.7824777
  },
  "ขอนแก่น|ภูผาม่าน": {
    "lat": 16.6401692,
    "lng": 101.9090201
  },
  "ขอนแก่น|ซำสูง": {
    "lat": 16.5682547,
    "lng": 103.0587399
  },
  "ขอนแก่น|โคกโพธิ์ไชย": {
    "lat": 16.0557992,
    "lng": 102.3692982
  },
  "ขอนแก่น|หนองนาคำ": {
    "lat": 16.8134948,
    "lng": 102.3403027
  },
  "ขอนแก่น|บ้านแฮด": {
    "lat": 16.2118723,
    "lng": 102.7537372
  },
  "ขอนแก่น|โนนศิลา": {
    "lat": 15.9581614,
    "lng": 102.6560717
  },
  "ขอนแก่น|เวียงเก่า": {
    "lat": 16.7089808,
    "lng": 102.2776838
  },
  "อุดรธานี|เมืองอุดรธานี": {
    "lat": 17.3980165,
    "lng": 102.7594847
  },
  "อุดรธานี|กุดจับ": {
    "lat": 17.4156306,
    "lng": 102.4839212
  },
  "อุดรธานี|หนองวัวซอ": {
    "lat": 17.2869444,
    "lng": 102.6002778
  },
  "อุดรธานี|กุมภวาปี": {
    "lat": 17.0801779,
    "lng": 103.0126523
  },
  "อุดรธานี|โนนสะอาด": {
    "lat": 16.9656259,
    "lng": 102.9032643
  },
  "อุดรธานี|หนองหาน": {
    "lat": 17.3645735,
    "lng": 103.0933171
  },
  "อุดรธานี|ทุ่งฝน": {
    "lat": 17.4851808,
    "lng": 103.1971067
  },
  "อุดรธานี|ไชยวาน": {
    "lat": 17.2009231,
    "lng": 103.2894368
  },
  "อุดรธานี|ศรีธาตุ": {
    "lat": 16.9767891,
    "lng": 103.2142418
  },
  "อุดรธานี|วังสามหมอ": {
    "lat": 16.955592,
    "lng": 103.4421742
  },
  "อุดรธานี|บ้านดุง": {
    "lat": 17.7032238,
    "lng": 103.2317225
  },
  "อุดรธานี|บ้านผือ": {
    "lat": 17.6851513,
    "lng": 102.4495221
  },
  "อุดรธานี|น้ำโสม": {
    "lat": 17.7338889,
    "lng": 102.0772222
  },
  "อุดรธานี|เพ็ญ": {
    "lat": 17.6769513,
    "lng": 102.932041
  },
  "อุดรธานี|สร้างคอม": {
    "lat": 17.8054891,
    "lng": 103.0933171
  },
  "อุดรธานี|หนองแสง": {
    "lat": 17.4905125,
    "lng": 102.8263951
  },
  "อุดรธานี|นายูง": {
    "lat": 17.1037919,
    "lng": 103.0134597
  },
  "อุดรธานี|พิบูลย์รักษ์": {
    "lat": 17.4944308,
    "lng": 103.0587399
  },
  "อุดรธานี|กู่แก้ว": {
    "lat": 17.1637859,
    "lng": 103.1509672
  },
  "อุดรธานี|ประจักษ์ศิลปาคม": {
    "lat": 17.2562283,
    "lng": 102.9780981
  },
  "เลย|เมืองเลย": {
    "lat": 17.4605379,
    "lng": 101.7523854
  },
  "เลย|นาด้วง": {
    "lat": 17.4847909,
    "lng": 101.9428012
  },
  "เลย|เชียงคาน": {
    "lat": 17.8759173,
    "lng": 101.6271544
  },
  "เลย|ปากชม": {
    "lat": 18.0226395,
    "lng": 101.8812018
  },
  "เลย|ด่านซ้าย": {
    "lat": 17.2506701,
    "lng": 101.1504111
  },
  "เลย|นาแห้ว": {
    "lat": 17.5263619,
    "lng": 100.9560676
  },
  "เลย|ภูเรือ": {
    "lat": 17.5144444,
    "lng": 101.3441667
  },
  "เลย|ท่าลี่": {
    "lat": 17.5971303,
    "lng": 101.4112049
  },
  "เลย|วังสะพุง": {
    "lat": 17.3099032,
    "lng": 101.7409946
  },
  "เลย|ภูกระดึง": {
    "lat": 16.8713889,
    "lng": 101.7186111
  },
  "เลย|ภูหลวง": {
    "lat": 17.0935616,
    "lng": 101.6612934
  },
  "เลย|ผาขาว": {
    "lat": 17.0502119,
    "lng": 102.0032957
  },
  "เลย|เอราวัณ": {
    "lat": 17.3702095,
    "lng": 101.900579
  },
  "เลย|หนองหิน": {
    "lat": 17.1074981,
    "lng": 101.8207566
  },
  "หนองคาย|เมืองหนองคาย": {
    "lat": 17.8841733,
    "lng": 102.750128
  },
  "หนองคาย|ท่าบ่อ": {
    "lat": 17.8111448,
    "lng": 102.5699643
  },
  "หนองคาย|โพนพิสัย": {
    "lat": 17.9747555,
    "lng": 103.0017133
  },
  "หนองคาย|ศรีเชียงใหม่": {
    "lat": 17.9381572,
    "lng": 102.4953899
  },
  "หนองคาย|สังคม": {
    "lat": 18.0153852,
    "lng": 102.1538632
  },
  "หนองคาย|สระใคร": {
    "lat": 17.7061453,
    "lng": 102.7537372
  },
  "หนองคาย|เฝ้าไร่": {
    "lat": 18.0002831,
    "lng": 103.3009828
  },
  "หนองคาย|รัตนวาปี": {
    "lat": 18.2174678,
    "lng": 103.1855702
  },
  "หนองคาย|โพธิ์ตาก": {
    "lat": 17.8494946,
    "lng": 102.4265952
  },
  "มหาสารคาม|เมืองมหาสารคาม": {
    "lat": 16.1383681,
    "lng": 103.2894368
  },
  "มหาสารคาม|แกดำ": {
    "lat": 16.1001934,
    "lng": 103.4007916
  },
  "มหาสารคาม|โกสุมพิสัย": {
    "lat": 16.269546,
    "lng": 103.035694
  },
  "มหาสารคาม|กันทรวิชัย": {
    "lat": 16.2795768,
    "lng": 103.2432632
  },
  "มหาสารคาม|เชียงยืน": {
    "lat": 16.4159483,
    "lng": 103.0933171
  },
  "มหาสารคาม|บรบือ": {
    "lat": 16.0915907,
    "lng": 103.1163739
  },
  "มหาสารคาม|นาเชือก": {
    "lat": 15.7734482,
    "lng": 103.0472164
  },
  "มหาสารคาม|พยัคฆภูมิพิสัย": {
    "lat": 15.5216056,
    "lng": 103.2201828
  },
  "มหาสารคาม|วาปีปทุม": {
    "lat": 15.8787325,
    "lng": 103.3419638
  },
  "มหาสารคาม|นาดูน": {
    "lat": 15.7223021,
    "lng": 103.2259525
  },
  "มหาสารคาม|ยางสีสุราช": {
    "lat": 15.6406722,
    "lng": 103.1509672
  },
  "มหาสารคาม|กุดรัง": {
    "lat": 16.1185799,
    "lng": 103.0249524
  },
  "มหาสารคาม|ชื่นชม": {
    "lat": 16.5515741,
    "lng": 103.139435
  },
  "ร้อยเอ็ด|เมืองร้อยเอ็ด": {
    "lat": 16.0537909,
    "lng": 103.6519972
  },
  "ร้อยเอ็ด|เกษตรวิสัย": {
    "lat": 15.6580509,
    "lng": 103.6131203
  },
  "ร้อยเอ็ด|ปทุมรัตต์": {
    "lat": 15.6021563,
    "lng": 103.4049445
  },
  "ร้อยเอ็ด|จตุรพักตรพิมาน": {
    "lat": 15.8447115,
    "lng": 103.5668302
  },
  "ร้อยเอ็ด|ธวัชบุรี": {
    "lat": 16.1110285,
    "lng": 103.8042382
  },
  "ร้อยเอ็ด|พนมไพร": {
    "lat": 15.6803037,
    "lng": 104.1146479
  },
  "ร้อยเอ็ด|โพนทอง": {
    "lat": 16.2143664,
    "lng": 103.9120099
  },
  "ร้อยเอ็ด|โพธิ์ชัย": {
    "lat": 16.3818183,
    "lng": 103.7984428
  },
  "ร้อยเอ็ด|หนองพอก": {
    "lat": 16.3413382,
    "lng": 104.2279672
  },
  "ร้อยเอ็ด|เสลภูมิ": {
    "lat": 16.0474745,
    "lng": 103.98402
  },
  "ร้อยเอ็ด|สุวรรณภูมิ": {
    "lat": 15.5789814,
    "lng": 103.7752634
  },
  "ร้อยเอ็ด|เมืองสรวง": {
    "lat": 15.7869648,
    "lng": 103.752088
  },
  "ร้อยเอ็ด|โพนทราย": {
    "lat": 15.4998892,
    "lng": 103.9376021
  },
  "ร้อยเอ็ด|อาจสามารถ": {
    "lat": 15.836139,
    "lng": 103.8796018
  },
  "ร้อยเอ็ด|เมยวดี": {
    "lat": 16.3966621,
    "lng": 104.1756573
  },
  "ร้อยเอ็ด|ศรีสมเด็จ": {
    "lat": 15.9706018,
    "lng": 103.4687168
  },
  "ร้อยเอ็ด|จังหาร": {
    "lat": 16.1360901,
    "lng": 103.5957596
  },
  "ร้อยเอ็ด|เชียงขวัญ": {
    "lat": 16.1820403,
    "lng": 103.7214955
  },
  "ร้อยเอ็ด|หนองฮี": {
    "lat": 15.6221834,
    "lng": 103.9956269
  },
  "ร้อยเอ็ด|ทุ่งเขาหลวง": {
    "lat": 16.0214032,
    "lng": 103.8564085
  },
  "กาฬสินธุ์|เมืองกาฬสินธุ์": {
    "lat": 16.438508,
    "lng": 103.5060994
  },
  "กาฬสินธุ์|นามน": {
    "lat": 16.5553936,
    "lng": 103.7868526
  },
  "กาฬสินธุ์|กมลาไสย": {
    "lat": 16.3171804,
    "lng": 103.5552603
  },
  "กาฬสินธุ์|ร่องคำ": {
    "lat": 16.2766583,
    "lng": 103.7347091
  },
  "กาฬสินธุ์|กุฉินารายณ์": {
    "lat": 16.504382,
    "lng": 104.0304535
  },
  "กาฬสินธุ์|เขาวง": {
    "lat": 16.6822686,
    "lng": 104.1233667
  },
  "กาฬสินธุ์|ยางตลาด": {
    "lat": 16.4003968,
    "lng": 103.3712281
  },
  "กาฬสินธุ์|ห้วยเม็ก": {
    "lat": 16.5564748,
    "lng": 103.2432632
  },
  "กาฬสินธุ์|สหัสขันธ์": {
    "lat": 16.7323365,
    "lng": 103.5552603
  },
  "กาฬสินธุ์|คำม่วง": {
    "lat": 16.9447497,
    "lng": 103.6594267
  },
  "กาฬสินธุ์|ท่าคันโท": {
    "lat": 16.9331709,
    "lng": 103.2259525
  },
  "กาฬสินธุ์|หนองกุงศรี": {
    "lat": 16.6335739,
    "lng": 103.3009828
  },
  "กาฬสินธุ์|สมเด็จ": {
    "lat": 16.7274697,
    "lng": 103.7358989
  },
  "กาฬสินธุ์|ห้วยผึ้ง": {
    "lat": 16.663973,
    "lng": 103.9071489
  },
  "กาฬสินธุ์|สามชัย": {
    "lat": 16.863677,
    "lng": 103.5366457
  },
  "กาฬสินธุ์|นาคู": {
    "lat": 16.8085029,
    "lng": 104.04787
  },
  "กาฬสินธุ์|ดอนจาน": {
    "lat": 16.4232826,
    "lng": 103.6941672
  },
  "กาฬสินธุ์|ฆ้องชัย": {
    "lat": 16.252555,
    "lng": 103.485862
  },
  "สกลนคร|เมืองสกลนคร": {
    "lat": 17.1435494,
    "lng": 104.1233667
  },
  "สกลนคร|กุสุมาลย์": {
    "lat": 17.3577323,
    "lng": 104.3559158
  },
  "สกลนคร|กุดบาก": {
    "lat": 17.085,
    "lng": 103.8016667
  },
  "สกลนคร|พรรณานิคม": {
    "lat": 17.3233062,
    "lng": 103.8680047
  },
  "สกลนคร|พังโคน": {
    "lat": 17.375525,
    "lng": 103.6999581
  },
  "สกลนคร|วาริชภูมิ": {
    "lat": 17.2361032,
    "lng": 103.6246954
  },
  "สกลนคร|นิคมน้ำอูน": {
    "lat": 17.1727135,
    "lng": 103.7057493
  },
  "สกลนคร|วานรนิวาส": {
    "lat": 17.644742,
    "lng": 103.7405019
  },
  "สกลนคร|คำตากล้า": {
    "lat": 17.8143982,
    "lng": 103.7984428
  },
  "สกลนคร|บ้านม่วง": {
    "lat": 17.9053046,
    "lng": 103.4974258
  },
  "สกลนคร|อากาศอำนวย": {
    "lat": 17.686931,
    "lng": 103.9608091
  },
  "สกลนคร|สว่างแดนดิน": {
    "lat": 17.4479326,
    "lng": 103.4049445
  },
  "สกลนคร|ส่องดาว": {
    "lat": 17.3397564,
    "lng": 103.4627375
  },
  "สกลนคร|เต่างอย": {
    "lat": 16.993967,
    "lng": 104.1989038
  },
  "สกลนคร|โคกศรีสุพรรณ": {
    "lat": 17.0380098,
    "lng": 104.3093759
  },
  "สกลนคร|เจริญศิลป์": {
    "lat": 17.5650372,
    "lng": 103.5552603
  },
  "สกลนคร|โพนนาแก้ว": {
    "lat": 17.2201778,
    "lng": 104.2909717
  },
  "สกลนคร|ภูพาน": {
    "lat": 17.0950622,
    "lng": 103.9606994
  },
  "นครพนม|เมืองนครพนม": {
    "lat": 17.3798237,
    "lng": 104.6821048
  },
  "นครพนม|ปลาปาก": {
    "lat": 17.1843004,
    "lng": 104.5189214
  },
  "นครพนม|ท่าอุเทน": {
    "lat": 17.6280795,
    "lng": 104.4490398
  },
  "นครพนม|บ้านแพง": {
    "lat": 17.9630254,
    "lng": 104.222154
  },
  "นครพนม|ธาตุพนม": {
    "lat": 16.9487975,
    "lng": 104.7248076
  },
  "นครพนม|เรณูนคร": {
    "lat": 17.0471522,
    "lng": 104.6804334
  },
  "นครพนม|นาแก": {
    "lat": 16.8863767,
    "lng": 104.4956239
  },
  "นครพนม|ศรีสงคราม": {
    "lat": 17.6294217,
    "lng": 104.2744808
  },
  "นครพนม|นาหว้า": {
    "lat": 17.4777267,
    "lng": 104.1349852
  },
  "นครพนม|โพนสวรรค์": {
    "lat": 17.4539619,
    "lng": 104.4606845
  },
  "นครพนม|นาทม": {
    "lat": 17.8315539,
    "lng": 104.0420642
  },
  "นครพนม|วังยาง": {
    "lat": 17.046531,
    "lng": 104.4315746
  },
  "มุกดาหาร|เมืองมุกดาหาร": {
    "lat": 16.537152,
    "lng": 104.7154762
  },
  "มุกดาหาร|นิคมคำสร้อย": {
    "lat": 16.3355896,
    "lng": 104.5597007
  },
  "มุกดาหาร|ดอนตาล": {
    "lat": 16.3112941,
    "lng": 104.8221147
  },
  "มุกดาหาร|ดงหลวง": {
    "lat": 16.8279683,
    "lng": 104.5072722
  },
  "มุกดาหาร|คำชะอี": {
    "lat": 16.5399822,
    "lng": 104.3391166
  },
  "มุกดาหาร|หว้านใหญ่": {
    "lat": 16.7137921,
    "lng": 104.7345937
  },
  "มุกดาหาร|หนองสูง": {
    "lat": 16.485,
    "lng": 104.3536111
  },
  "เชียงใหม่|เมืองเชียงใหม่": {
    "lat": 18.7952345,
    "lng": 98.9355737
  },
  "เชียงใหม่|จอมทอง": {
    "lat": 18.4687853,
    "lng": 98.6160674
  },
  "เชียงใหม่|แม่แจ่ม": {
    "lat": 18.7142442,
    "lng": 98.3964938
  },
  "เชียงใหม่|เชียงดาว": {
    "lat": 19.3483988,
    "lng": 98.964938
  },
  "เชียงใหม่|ดอยสะเก็ด": {
    "lat": 18.8629982,
    "lng": 99.1148431
  },
  "เชียงใหม่|แม่แตง": {
    "lat": 19.2102028,
    "lng": 98.8803925
  },
  "เชียงใหม่|แม่ริม": {
    "lat": 18.9028017,
    "lng": 98.9024603
  },
  "เชียงใหม่|สะเมิง": {
    "lat": 18.9399005,
    "lng": 98.6160674
  },
  "เชียงใหม่|ฝาง": {
    "lat": 19.9516363,
    "lng": 99.1456153
  },
  "เชียงใหม่|แม่อาย": {
    "lat": 20.0638367,
    "lng": 99.2563859
  },
  "เชียงใหม่|พร้าว": {
    "lat": 19.2869151,
    "lng": 99.2342196
  },
  "เชียงใหม่|สันป่าตอง": {
    "lat": 18.573179,
    "lng": 98.9024603
  },
  "เชียงใหม่|สันกำแพง": {
    "lat": 18.7448892,
    "lng": 99.0863932
  },
  "เชียงใหม่|สันทราย": {
    "lat": 18.8942314,
    "lng": 99.0792263
  },
  "เชียงใหม่|หางดง": {
    "lat": 18.714302,
    "lng": 98.9396534
  },
  "เชียงใหม่|ฮอด": {
    "lat": 18.1055904,
    "lng": 98.5830907
  },
  "เชียงใหม่|ดอยเต่า": {
    "lat": 17.9442219,
    "lng": 98.6435589
  },
  "เชียงใหม่|อมก๋อย": {
    "lat": 17.9158197,
    "lng": 98.352656
  },
  "เชียงใหม่|สารภี": {
    "lat": 18.7080539,
    "lng": 99.0349977
  },
  "เชียงใหม่|เวียงแหง": {
    "lat": 19.5759617,
    "lng": 98.6273205
  },
  "เชียงใหม่|ไชยปราการ": {
    "lat": 19.7324423,
    "lng": 99.1409117
  },
  "เชียงใหม่|แม่วาง": {
    "lat": 18.6796993,
    "lng": 98.6380598
  },
  "เชียงใหม่|แม่ออน": {
    "lat": 18.7425957,
    "lng": 99.1118631
  },
  "เชียงใหม่|ดอยหล่อ": {
    "lat": 18.4729631,
    "lng": 98.7811645
  },
  "เชียงใหม่|กัลยาณิวัฒนา": {
    "lat": 18.978506,
    "lng": 98.2869478
  },
  "ลำพูน|เมืองลำพูน": {
    "lat": 18.5744058,
    "lng": 99.0087343
  },
  "ลำพูน|แม่ทา": {
    "lat": 18.4214923,
    "lng": 99.1234795
  },
  "ลำพูน|บ้านโฮ่ง": {
    "lat": 18.3062391,
    "lng": 98.8252502
  },
  "ลำพูน|ลี้": {
    "lat": 17.7822278,
    "lng": 98.9797467
  },
  "ลำพูน|ทุ่งหัวช้าง": {
    "lat": 18.0027045,
    "lng": 99.0349977
  },
  "ลำพูน|ป่าซาง": {
    "lat": 18.5237158,
    "lng": 98.9397379
  },
  "ลำพูน|บ้านธิ": {
    "lat": 18.6197909,
    "lng": 99.1566855
  },
  "ลำพูน|เวียงหนองล่อง": {
    "lat": 18.4264929,
    "lng": 98.7840155
  },
  "ลำปาง|เมืองลำปาง": {
    "lat": 18.4219661,
    "lng": 99.5896043
  },
  "ลำปาง|แม่เมาะ": {
    "lat": 18.4082257,
    "lng": 99.8571416
  },
  "ลำปาง|เกาะคา": {
    "lat": 18.181371,
    "lng": 99.3506604
  },
  "ลำปาง|เสริมงาม": {
    "lat": 18.0679495,
    "lng": 99.1456153
  },
  "ลำปาง|งาว": {
    "lat": 18.7767838,
    "lng": 99.9698029
  },
  "ลำปาง|แจ้ห่ม": {
    "lat": 18.6893329,
    "lng": 99.6452714
  },
  "ลำปาง|วังเหนือ": {
    "lat": 19.0755958,
    "lng": 99.6786894
  },
  "ลำปาง|เถิน": {
    "lat": 17.5903289,
    "lng": 99.3229213
  },
  "ลำปาง|แม่พริก": {
    "lat": 17.5089364,
    "lng": 99.0571089
  },
  "ลำปาง|แม่ทะ": {
    "lat": 18.1886444,
    "lng": 99.5351236
  },
  "ลำปาง|สบปราบ": {
    "lat": 17.8471851,
    "lng": 99.3451118
  },
  "ลำปาง|ห้างฉัตร": {
    "lat": 18.3335049,
    "lng": 99.3617587
  },
  "ลำปาง|เมืองปาน": {
    "lat": 18.7936282,
    "lng": 99.4450439
  },
  "อุตรดิตถ์|เมืองอุตรดิตถ์": {
    "lat": 17.7332664,
    "lng": 100.2151578
  },
  "อุตรดิตถ์|ตรอน": {
    "lat": 17.4835121,
    "lng": 100.1118365
  },
  "อุตรดิตถ์|ท่าปลา": {
    "lat": 17.7947452,
    "lng": 100.4072583
  },
  "อุตรดิตถ์|น้ำปาด": {
    "lat": 17.7043083,
    "lng": 100.7548851
  },
  "อุตรดิตถ์|ฟากท่า": {
    "lat": 18.0248068,
    "lng": 100.8767282
  },
  "อุตรดิตถ์|บ้านโคก": {
    "lat": 18.250185,
    "lng": 101.0259275
  },
  "อุตรดิตถ์|พิชัย": {
    "lat": 17.2702191,
    "lng": 100.1255164
  },
  "อุตรดิตถ์|ลับแล": {
    "lat": 17.7202883,
    "lng": 100.0135929
  },
  "อุตรดิตถ์|ทองแสนขัน": {
    "lat": 17.5414537,
    "lng": 100.3048897
  },
  "แพร่|เมืองแพร่": {
    "lat": 18.103139,
    "lng": 100.3048897
  },
  "แพร่|ร้องกวาง": {
    "lat": 18.3423505,
    "lng": 100.3178694
  },
  "แพร่|ลอง": {
    "lat": 18.0402778,
    "lng": 99.7322222
  },
  "แพร่|สูงเม่น": {
    "lat": 18.0435607,
    "lng": 100.1031202
  },
  "แพร่|เด่นชัย": {
    "lat": 17.9644735,
    "lng": 100.0471549
  },
  "แพร่|สอง": {
    "lat": 18.5784068,
    "lng": 100.2244717
  },
  "แพร่|วังชิ้น": {
    "lat": 17.8319922,
    "lng": 99.6564092
  },
  "แพร่|หนองม่วงไข่": {
    "lat": 18.2613889,
    "lng": 100.1872222
  },
  "น่าน|เมืองน่าน": {
    "lat": 18.7756094,
    "lng": 100.7730685
  },
  "น่าน|แม่จริม": {
    "lat": 18.7130662,
    "lng": 101.1164452
  },
  "น่าน|บ้านหลวง": {
    "lat": 18.868327,
    "lng": 100.4621366
  },
  "น่าน|นาน้อย": {
    "lat": 18.3052743,
    "lng": 100.6759772
  },
  "น่าน|ปัว": {
    "lat": 19.1651322,
    "lng": 100.9072516
  },
  "น่าน|ท่าวังผา": {
    "lat": 19.1096292,
    "lng": 100.7548851
  },
  "น่าน|เวียงสา": {
    "lat": 18.6064518,
    "lng": 100.5296115
  },
  "น่าน|ทุ่งช้าง": {
    "lat": 19.3915669,
    "lng": 100.9467939
  },
  "น่าน|เชียงกลาง": {
    "lat": 19.2877661,
    "lng": 100.8620883
  },
  "น่าน|นาหมื่น": {
    "lat": 18.1821215,
    "lng": 100.5746224
  },
  "น่าน|สันติสุข": {
    "lat": 18.7915629,
    "lng": 100.7832784
  },
  "น่าน|บ่อเกลือ": {
    "lat": 19.3289415,
    "lng": 101.1693793
  },
  "น่าน|สองแคว": {
    "lat": 19.3966901,
    "lng": 100.6647101
  },
  "น่าน|ภูเพียง": {
    "lat": 18.7980755,
    "lng": 100.8677256
  },
  "น่าน|เฉลิมพระเกียรติ": {
    "lat": 18.8672644,
    "lng": 100.4383453
  },
  "พะเยา|เมืองพะเยา": {
    "lat": 19.1664466,
    "lng": 99.9019888
  },
  "พะเยา|จุน": {
    "lat": 19.4276964,
    "lng": 100.1255164
  },
  "พะเยา|เชียงคำ": {
    "lat": 19.4987437,
    "lng": 100.3251564
  },
  "พะเยา|เชียงม่วน": {
    "lat": 18.8758954,
    "lng": 100.3273368
  },
  "พะเยา|ดอกคำใต้": {
    "lat": 19.1485575,
    "lng": 99.9632741
  },
  "พะเยา|ปง": {
    "lat": 19.1182974,
    "lng": 100.1927389
  },
  "พะเยา|แม่ใจ": {
    "lat": 19.3755572,
    "lng": 99.7901781
  },
  "พะเยา|ภูซาง": {
    "lat": 19.6723498,
    "lng": 100.3722477
  },
  "พะเยา|ภูกามยาว": {
    "lat": 19.1651615,
    "lng": 99.8738907
  },
  "เชียงราย|เมืองเชียงราย": {
    "lat": 19.9104798,
    "lng": 99.840576
  },
  "เชียงราย|เวียงชัย": {
    "lat": 19.8627204,
    "lng": 99.9043743
  },
  "เชียงราย|เชียงของ": {
    "lat": 20.1651266,
    "lng": 100.3947116
  },
  "เชียงราย|เทิง": {
    "lat": 19.6856774,
    "lng": 100.1974388
  },
  "เชียงราย|พาน": {
    "lat": 19.6357433,
    "lng": 99.7678687
  },
  "เชียงราย|ป่าแดด": {
    "lat": 19.5156623,
    "lng": 100.0247788
  },
  "เชียงราย|แม่จัน": {
    "lat": 20.0932902,
    "lng": 99.8013351
  },
  "เชียงราย|เชียงแสน": {
    "lat": 20.2450245,
    "lng": 100.2375823
  },
  "เชียงราย|แม่สาย": {
    "lat": 20.4592635,
    "lng": 99.9422372
  },
  "เชียงราย|แม่สรวย": {
    "lat": 19.6701183,
    "lng": 99.5673479
  },
  "เชียงราย|เวียงป่าเป้า": {
    "lat": 19.3720454,
    "lng": 99.4117197
  },
  "เชียงราย|พญาเม็งราย": {
    "lat": 19.8735119,
    "lng": 100.1479182
  },
  "เชียงราย|เวียงแก่น": {
    "lat": 19.9964005,
    "lng": 100.4621366
  },
  "เชียงราย|ขุนตาล": {
    "lat": 19.8657628,
    "lng": 100.2824483
  },
  "เชียงราย|แม่ฟ้าหลวง": {
    "lat": 20.2756662,
    "lng": 99.7009754
  },
  "เชียงราย|แม่ลาว": {
    "lat": 19.7447709,
    "lng": 99.7121206
  },
  "เชียงราย|เวียงเชียงรุ้ง": {
    "lat": 19.9976243,
    "lng": 100.0359661
  },
  "เชียงราย|ดอยหลวง": {
    "lat": 20.0838889,
    "lng": 100.0330556
  },
  "แม่ฮ่องสอน|เมืองแม่ฮ่องสอน": {
    "lat": 19.2990244,
    "lng": 97.9656213
  },
  "แม่ฮ่องสอน|ขุนยวม": {
    "lat": 18.7370307,
    "lng": 97.87216
  },
  "แม่ฮ่องสอน|ปาย": {
    "lat": 19.3582191,
    "lng": 98.4404863
  },
  "แม่ฮ่องสอน|แม่สะเรียง": {
    "lat": 18.1587905,
    "lng": 97.931419
  },
  "แม่ฮ่องสอน|แม่ลาน้อย": {
    "lat": 18.380624,
    "lng": 97.9374948
  },
  "แม่ฮ่องสอน|สบเมย": {
    "lat": 17.9114625,
    "lng": 97.8939317
  },
  "แม่ฮ่องสอน|ปางมะผ้า": {
    "lat": 19.6208458,
    "lng": 98.1775638
  },
  "นครสวรรค์|เมืองนครสวรรค์": {
    "lat": 15.6987382,
    "lng": 100.11996
  },
  "นครสวรรค์|โกรกพระ": {
    "lat": 15.5758351,
    "lng": 100.0801292
  },
  "นครสวรรค์|ชุมแสง": {
    "lat": 15.8929623,
    "lng": 100.3006904
  },
  "นครสวรรค์|หนองบัว": {
    "lat": 15.8589974,
    "lng": 100.6534443
  },
  "นครสวรรค์|บรรพตพิสัย": {
    "lat": 15.9235757,
    "lng": 100.0066295
  },
  "นครสวรรค์|เก้าเลี้ยว": {
    "lat": 15.8413525,
    "lng": 100.0745343
  },
  "นครสวรรค์|ตาคลี": {
    "lat": 15.2461111,
    "lng": 100.3361111
  },
  "นครสวรรค์|ท่าตะโก": {
    "lat": 15.6428938,
    "lng": 100.4894759
  },
  "นครสวรรค์|ไพศาลี": {
    "lat": 15.6251826,
    "lng": 100.6985155
  },
  "นครสวรรค์|พยุหะคีรี": {
    "lat": 15.4581338,
    "lng": 100.1369572
  },
  "นครสวรรค์|ลาดยาว": {
    "lat": 15.7631488,
    "lng": 99.7344154
  },
  "นครสวรรค์|ตากฟ้า": {
    "lat": 15.3705253,
    "lng": 100.4621366
  },
  "นครสวรรค์|แม่วงก์": {
    "lat": 15.7821908,
    "lng": 99.5673479
  },
  "นครสวรรค์|แม่เปิน": {
    "lat": 15.6970407,
    "lng": 99.389511
  },
  "นครสวรรค์|ชุมตาบง": {
    "lat": 15.6085632,
    "lng": 99.5562219
  },
  "อุทัยธานี|เมืองอุทัยธานี": {
    "lat": 15.4375499,
    "lng": 100.0135929
  },
  "อุทัยธานี|ทัพทัน": {
    "lat": 15.462908,
    "lng": 99.8895173
  },
  "อุทัยธานี|สว่างอารมณ์": {
    "lat": 15.5493633,
    "lng": 99.8459774
  },
  "อุทัยธานี|หนองฉาง": {
    "lat": 15.3549041,
    "lng": 99.7901781
  },
  "อุทัยธานี|หนองขาหย่าง": {
    "lat": 15.3620878,
    "lng": 99.9394424
  },
  "อุทัยธานี|บ้านไร่": {
    "lat": 15.262799,
    "lng": 99.2342196
  },
  "อุทัยธานี|ลานสัก": {
    "lat": 15.4681655,
    "lng": 99.5375509
  },
  "อุทัยธานี|ห้วยคต": {
    "lat": 15.2438889,
    "lng": 99.6025
  },
  "กำแพงเพชร|เมืองกำแพงเพชร": {
    "lat": 16.4801833,
    "lng": 99.5204467
  },
  "กำแพงเพชร|ไทรงาม": {
    "lat": 16.4768529,
    "lng": 99.890643
  },
  "กำแพงเพชร|คลองลาน": {
    "lat": 16.1258945,
    "lng": 99.2714326
  },
  "กำแพงเพชร|ขาณุวรลักษบุรี": {
    "lat": 16.0954654,
    "lng": 99.8348146
  },
  "กำแพงเพชร|คลองขลุง": {
    "lat": 16.2291679,
    "lng": 99.6948781
  },
  "กำแพงเพชร|พรานกระต่าย": {
    "lat": 16.6567275,
    "lng": 99.5339744
  },
  "กำแพงเพชร|ลานกระบือ": {
    "lat": 16.6177269,
    "lng": 99.8683073
  },
  "กำแพงเพชร|ทรายทองวัฒนา": {
    "lat": 16.326027,
    "lng": 99.8794744
  },
  "กำแพงเพชร|ปางศิลาทอง": {
    "lat": 16.0244212,
    "lng": 99.3451118
  },
  "กำแพงเพชร|บึงสามัคคี": {
    "lat": 16.2863752,
    "lng": 99.9800438
  },
  "กำแพงเพชร|โกสัมพีนคร": {
    "lat": 16.626937,
    "lng": 99.3504371
  },
  "ตาก|เมืองตาก": {
    "lat": 16.8839446,
    "lng": 99.1259054
  },
  "ตาก|บ้านตาก": {
    "lat": 17.0405373,
    "lng": 99.0571089
  },
  "ตาก|สามเงา": {
    "lat": 17.2099785,
    "lng": 99.0626377
  },
  "ตาก|แม่ระมาด": {
    "lat": 17.1155556,
    "lng": 98.5533333
  },
  "ตาก|ท่าสองยาง": {
    "lat": 17.5674553,
    "lng": 97.9230053
  },
  "ตาก|แม่สอด": {
    "lat": 16.7019564,
    "lng": 98.5435378
  },
  "ตาก|พบพระ": {
    "lat": 16.3901076,
    "lng": 98.6930685
  },
  "ตาก|อุ้มผาง": {
    "lat": 15.8794014,
    "lng": 98.9245343
  },
  "ตาก|วังเจ้า": {
    "lat": 16.6625992,
    "lng": 99.1456153
  },
  "สุโขทัย|เมืองสุโขทัย": {
    "lat": 16.9809658,
    "lng": 99.8348146
  },
  "สุโขทัย|บ้านด่านลานหอย": {
    "lat": 17.1137554,
    "lng": 99.5006143
  },
  "สุโขทัย|คีรีมาศ": {
    "lat": 16.8207716,
    "lng": 99.7678687
  },
  "สุโขทัย|กงไกรลาศ": {
    "lat": 16.9524358,
    "lng": 99.973995
  },
  "สุโขทัย|ศรีสัชนาลัย": {
    "lat": 17.5731838,
    "lng": 99.6786894
  },
  "สุโขทัย|ศรีสำโรง": {
    "lat": 17.1635023,
    "lng": 99.8620233
  },
  "สุโขทัย|สวรรคโลก": {
    "lat": 17.3091916,
    "lng": 99.8434475
  },
  "สุโขทัย|ศรีนคร": {
    "lat": 17.3593492,
    "lng": 99.9800438
  },
  "สุโขทัย|ทุ่งเสลี่ยม": {
    "lat": 17.3168141,
    "lng": 99.6564092
  },
  "พิษณุโลก|เมืองพิษณุโลก": {
    "lat": 16.8211238,
    "lng": 100.2658516
  },
  "พิษณุโลก|นครไทย": {
    "lat": 17.1337159,
    "lng": 100.8395029
  },
  "พิษณุโลก|ชาติตระการ": {
    "lat": 17.310993,
    "lng": 100.6872457
  },
  "พิษณุโลก|บางระกำ": {
    "lat": 16.7445704,
    "lng": 100.1367166
  },
  "พิษณุโลก|บางกระทุ่ม": {
    "lat": 16.5909145,
    "lng": 100.2992789
  },
  "พิษณุโลก|พรหมพิราม": {
    "lat": 17.0222158,
    "lng": 100.1815316
  },
  "พิษณุโลก|วัดโบสถ์": {
    "lat": 17.1630379,
    "lng": 100.3947116
  },
  "พิษณุโลก|วังทอง": {
    "lat": 16.8254324,
    "lng": 100.4297566
  },
  "พิษณุโลก|เนินมะปราง": {
    "lat": 16.6020807,
    "lng": 100.6534443
  },
  "พิจิตร|เมืองพิจิตร": {
    "lat": 16.4418293,
    "lng": 100.3722477
  },
  "พิจิตร|วังทรายพูน": {
    "lat": 16.3962348,
    "lng": 100.5858786
  },
  "พิจิตร|โพธิ์ประทับช้าง": {
    "lat": 16.2768808,
    "lng": 100.2423976
  },
  "พิจิตร|ตะพานหิน": {
    "lat": 16.2154243,
    "lng": 100.4256085
  },
  "พิจิตร|บางมูลนาก": {
    "lat": 16.0362738,
    "lng": 100.4087543
  },
  "พิจิตร|โพทะเล": {
    "lat": 16.1047137,
    "lng": 100.2544044
  },
  "พิจิตร|สามง่าม": {
    "lat": 16.5017629,
    "lng": 100.2050471
  },
  "พิจิตร|ทับคล้อ": {
    "lat": 16.1539933,
    "lng": 100.5521142
  },
  "พิจิตร|สากเหล็ก": {
    "lat": 16.4949293,
    "lng": 100.4733789
  },
  "พิจิตร|บึงนาราง": {
    "lat": 16.1908333,
    "lng": 100.1413889
  },
  "พิจิตร|ดงเจริญ": {
    "lat": 16.0235446,
    "lng": 100.608395
  },
  "พิจิตร|วชิรบารมี": {
    "lat": 16.5015931,
    "lng": 100.1031202
  },
  "เพชรบูรณ์|เมืองเพชรบูรณ์": {
    "lat": 16.3754838,
    "lng": 101.207047
  },
  "เพชรบูรณ์|ชนแดน": {
    "lat": 16.1479075,
    "lng": 100.901604
  },
  "เพชรบูรณ์|หล่มสัก": {
    "lat": 16.787692,
    "lng": 101.2089781
  },
  "เพชรบูรณ์|หล่มเก่า": {
    "lat": 16.8877073,
    "lng": 101.2273373
  },
  "เพชรบูรณ์|วิเชียรบุรี": {
    "lat": 15.9810604,
    "lng": 101.0629039
  },
  "เพชรบูรณ์|ศรีเทพ": {
    "lat": 15.4601543,
    "lng": 101.1949191
  },
  "เพชรบูรณ์|หนองไผ่": {
    "lat": 16.001807,
    "lng": 101.0372376
  },
  "เพชรบูรณ์|บึงสามพัน": {
    "lat": 15.780346,
    "lng": 101.0069175
  },
  "เพชรบูรณ์|น้ำหนาว": {
    "lat": 16.9128001,
    "lng": 101.5702813
  },
  "เพชรบูรณ์|วังโป่ง": {
    "lat": 16.3603106,
    "lng": 100.8338593
  },
  "เพชรบูรณ์|เขาค้อ": {
    "lat": 16.6813889,
    "lng": 100.9375
  },
  "ราชบุรี|เมืองราชบุรี": {
    "lat": 13.5282953,
    "lng": 99.8135584
  },
  "ราชบุรี|จอมบึง": {
    "lat": 13.6119882,
    "lng": 99.6118667
  },
  "ราชบุรี|สวนผึ้ง": {
    "lat": 13.6034188,
    "lng": 99.2342196
  },
  "ราชบุรี|ดำเนินสะดวก": {
    "lat": 13.6306911,
    "lng": 99.9177141
  },
  "ราชบุรี|บ้านโป่ง": {
    "lat": 13.8105014,
    "lng": 99.8766825
  },
  "ราชบุรี|บางแพ": {
    "lat": 13.6784265,
    "lng": 99.9576849
  },
  "ราชบุรี|โพธาราม": {
    "lat": 13.6965535,
    "lng": 99.8500058
  },
  "ราชบุรี|ปากท่อ": {
    "lat": 13.3801622,
    "lng": 99.8403959
  },
  "ราชบุรี|วัดเพลง": {
    "lat": 13.4473792,
    "lng": 99.8738907
  },
  "ราชบุรี|บ้านคา": {
    "lat": 13.3916523,
    "lng": 99.389511
  },
  "กาญจนบุรี|เมืองกาญจนบุรี": {
    "lat": 14.0103702,
    "lng": 99.5624106
  },
  "กาญจนบุรี|ไทรโยค": {
    "lat": 14.403167,
    "lng": 98.7481167
  },
  "กาญจนบุรี|บ่อพลอย": {
    "lat": 14.3315804,
    "lng": 99.4117197
  },
  "กาญจนบุรี|ศรีสวัสดิ์": {
    "lat": 14.5743218,
    "lng": 99.1013498
  },
  "กาญจนบุรี|ท่ามะกา": {
    "lat": 13.9317086,
    "lng": 99.7846002
  },
  "กาญจนบุรี|ท่าม่วง": {
    "lat": 13.8649215,
    "lng": 99.5896043
  },
  "กาญจนบุรี|ทองผาภูมิ": {
    "lat": 14.772736,
    "lng": 98.7481167
  },
  "กาญจนบุรี|สังขละบุรี": {
    "lat": 15.1543047,
    "lng": 98.4537664
  },
  "กาญจนบุรี|พนมทวน": {
    "lat": 14.1240285,
    "lng": 99.7121206
  },
  "กาญจนบุรี|เลาขวัญ": {
    "lat": 14.5569444,
    "lng": 99.7044444
  },
  "กาญจนบุรี|ด่านมะขามเตี้ย": {
    "lat": 13.8183104,
    "lng": 99.3118282
  },
  "กาญจนบุรี|หนองปรือ": {
    "lat": 14.6025,
    "lng": 99.4530556
  },
  "กาญจนบุรี|ห้วยกระเจา": {
    "lat": 14.3361111,
    "lng": 99.6538889
  },
  "สุพรรณบุรี|เมืองสุพรรณบุรี": {
    "lat": 14.4861012,
    "lng": 100.1255164
  },
  "สุพรรณบุรี|เดิมบางนางบวช": {
    "lat": 14.8908171,
    "lng": 100.0919243
  },
  "สุพรรณบุรี|ด่านช้าง": {
    "lat": 14.7983803,
    "lng": 99.5562219
  },
  "สุพรรณบุรี|บางปลาม้า": {
    "lat": 14.4060686,
    "lng": 100.1143176
  },
  "สุพรรณบุรี|ศรีประจันต์": {
    "lat": 14.6533982,
    "lng": 100.1285257
  },
  "สุพรรณบุรี|ดอนเจดีย์": {
    "lat": 14.618048,
    "lng": 100.0024084
  },
  "สุพรรณบุรี|สองพี่น้อง": {
    "lat": 14.220008,
    "lng": 100.0303723
  },
  "สุพรรณบุรี|สามชุก": {
    "lat": 14.7579513,
    "lng": 100.0975221
  },
  "สุพรรณบุรี|อู่ทอง": {
    "lat": 14.4735907,
    "lng": 99.8794744
  },
  "สุพรรณบุรี|หนองหญ้าไซ": {
    "lat": 14.7611675,
    "lng": 99.890643
  },
  "นครปฐม|เมืองนครปฐม": {
    "lat": 13.8140293,
    "lng": 100.0372929
  },
  "นครปฐม|กำแพงแสน": {
    "lat": 13.9967993,
    "lng": 99.9857224
  },
  "นครปฐม|นครชัยศรี": {
    "lat": 13.7921746,
    "lng": 100.1979459
  },
  "นครปฐม|ดอนตูม": {
    "lat": 13.9982009,
    "lng": 100.1199168
  },
  "นครปฐม|บางเลน": {
    "lat": 14.0073123,
    "lng": 100.1759285
  },
  "นครปฐม|สามพราน": {
    "lat": 13.7445573,
    "lng": 100.2410976
  },
  "นครปฐม|พุทธมณฑล": {
    "lat": 13.7767548,
    "lng": 100.3208828
  },
  "สมุทรสาคร|เมืองสมุทรสาคร": {
    "lat": 13.5489008,
    "lng": 100.2739306
  },
  "สมุทรสาคร|กระทุ่มแบน": {
    "lat": 13.6427173,
    "lng": 100.2712297
  },
  "สมุทรสาคร|บ้านแพ้ว": {
    "lat": 13.5904726,
    "lng": 100.1077163
  },
  "สมุทรสงคราม|เมืองสมุทรสงคราม": {
    "lat": 13.4094552,
    "lng": 100.0019995
  },
  "สมุทรสงคราม|บางคนที": {
    "lat": 13.4775807,
    "lng": 99.9231747
  },
  "สมุทรสงคราม|อัมพวา": {
    "lat": 13.3601931,
    "lng": 99.9129845
  },
  "เพชรบุรี|เมืองเพชรบุรี": {
    "lat": 13.0957579,
    "lng": 99.9688636
  },
  "เพชรบุรี|เขาย้อย": {
    "lat": 13.2355556,
    "lng": 99.8258333
  },
  "เพชรบุรี|หนองหญ้าปล้อง": {
    "lat": 13.2082073,
    "lng": 99.7121206
  },
  "เพชรบุรี|ชะอำ": {
    "lat": 12.799688,
    "lng": 99.9668273
  },
  "เพชรบุรี|ท่ายาง": {
    "lat": 12.9558297,
    "lng": 99.9073986
  },
  "เพชรบุรี|บ้านลาด": {
    "lat": 13.0553578,
    "lng": 99.8348146
  },
  "เพชรบุรี|บ้านแหลม": {
    "lat": 13.1978672,
    "lng": 99.9800438
  },
  "เพชรบุรี|แก่งกระจาน": {
    "lat": 12.8988453,
    "lng": 99.6063006
  },
  "ประจวบคีรีขันธ์|เมืองประจวบคีรีขันธ์": {
    "lat": 11.7938389,
    "lng": 99.7957564
  },
  "ประจวบคีรีขันธ์|กุยบุรี": {
    "lat": 12.1275768,
    "lng": 99.7678687
  },
  "ประจวบคีรีขันธ์|ทับสะแก": {
    "lat": 11.5259227,
    "lng": 99.5673479
  },
  "ประจวบคีรีขันธ์|บางสะพาน": {
    "lat": 11.2124065,
    "lng": 99.5089593
  },
  "ประจวบคีรีขันธ์|บางสะพานน้อย": {
    "lat": 11.0626883,
    "lng": 99.3229213
  },
  "ประจวบคีรีขันธ์|ปราณบุรี": {
    "lat": 12.4607784,
    "lng": 99.7846002
  },
  "ประจวบคีรีขันธ์|หัวหิน": {
    "lat": 12.5683747,
    "lng": 99.9576888
  },
  "ประจวบคีรีขันธ์|สามร้อยยอด": {
    "lat": 12.3958358,
    "lng": 99.8571416
  },
  "นครศรีธรรมราช|เมืองนครศรีธรรมราช": {
    "lat": 8.4235956,
    "lng": 99.9618712
  },
  "นครศรีธรรมราช|พรหมคีรี": {
    "lat": 8.52144,
    "lng": 99.8251398
  },
  "นครศรีธรรมราช|ลานสกา": {
    "lat": 8.4063095,
    "lng": 99.7678687
  },
  "นครศรีธรรมราช|ฉวาง": {
    "lat": 8.4658558,
    "lng": 99.4928382
  },
  "นครศรีธรรมราช|พิปูน": {
    "lat": 8.5842712,
    "lng": 99.5896043
  },
  "นครศรีธรรมราช|เชียรใหญ่": {
    "lat": 8.2085931,
    "lng": 100.1087187
  },
  "นครศรีธรรมราช|ชะอวด": {
    "lat": 8.001079,
    "lng": 100.0024084
  },
  "นครศรีธรรมราช|ท่าศาลา": {
    "lat": 8.6459062,
    "lng": 99.9409196
  },
  "นครศรีธรรมราช|ทุ่งสง": {
    "lat": 8.149005,
    "lng": 99.6786894
  },
  "นครศรีธรรมราช|นาบอน": {
    "lat": 8.2607711,
    "lng": 99.5228528
  },
  "นครศรีธรรมราช|ทุ่งใหญ่": {
    "lat": 8.3605689,
    "lng": 99.4228263
  },
  "นครศรีธรรมราช|ปากพนัง": {
    "lat": 8.287423,
    "lng": 100.1927389
  },
  "นครศรีธรรมราช|ร่อนพิบูลย์": {
    "lat": 8.16682,
    "lng": 99.8348146
  },
  "นครศรีธรรมราช|สิชล": {
    "lat": 9.0077023,
    "lng": 99.891325
  },
  "นครศรีธรรมราช|ขนอม": {
    "lat": 9.1938889,
    "lng": 99.8411111
  },
  "นครศรีธรรมราช|หัวไทร": {
    "lat": 8.0448717,
    "lng": 100.2844485
  },
  "นครศรีธรรมราช|บางขัน": {
    "lat": 7.9806473,
    "lng": 99.5006143
  },
  "นครศรีธรรมราช|ถ้ำพรรณรา": {
    "lat": 8.4211022,
    "lng": 99.3839598
  },
  "นครศรีธรรมราช|จุฬาภรณ์": {
    "lat": 8.0794544,
    "lng": 99.8794744
  },
  "นครศรีธรรมราช|พระพรหม": {
    "lat": 8.3373304,
    "lng": 99.923859
  },
  "นครศรีธรรมราช|นบพิตำ": {
    "lat": 8.7220939,
    "lng": 99.7506661
  },
  "นครศรีธรรมราช|ช้างกลาง": {
    "lat": 8.3440995,
    "lng": 99.6564092
  },
  "นครศรีธรรมราช|เฉลิมพระเกียรติ": {
    "lat": 8.1723748,
    "lng": 100.0471549
  },
  "กระบี่|เมืองกระบี่": {
    "lat": 8.1673273,
    "lng": 98.8803925
  },
  "กระบี่|เขาพนม": {
    "lat": 8.2841667,
    "lng": 98.9383333
  },
  "กระบี่|เกาะลันตา": {
    "lat": 7.6243677,
    "lng": 99.0792263
  },
  "กระบี่|คลองท่อม": {
    "lat": 7.9319346,
    "lng": 99.0912441
  },
  "กระบี่|อ่าวลึก": {
    "lat": 8.3425807,
    "lng": 98.7921836
  },
  "กระบี่|ปลายพระยา": {
    "lat": 8.5143073,
    "lng": 98.8803925
  },
  "กระบี่|ลำทับ": {
    "lat": 8.0820246,
    "lng": 99.3118282
  },
  "กระบี่|เหนือคลอง": {
    "lat": 8.0894697,
    "lng": 98.9797467
  },
  "พังงา|เมืองพังงา": {
    "lat": 8.4352303,
    "lng": 98.5281613
  },
  "พังงา|เกาะยาว": {
    "lat": 8.1191782,
    "lng": 98.6050736
  },
  "พังงา|กะปง": {
    "lat": 8.6431839,
    "lng": 98.4732718
  },
  "พังงา|ตะกั่วทุ่ง": {
    "lat": 8.3289957,
    "lng": 98.4184224
  },
  "พังงา|ตะกั่วป่า": {
    "lat": 8.8964671,
    "lng": 98.3745717
  },
  "พังงา|คุระบุรี": {
    "lat": 9.2236913,
    "lng": 98.4403573
  },
  "พังงา|ทับปุด": {
    "lat": 8.5415302,
    "lng": 98.6380598
  },
  "พังงา|ท้ายเหมือง": {
    "lat": 8.4621526,
    "lng": 98.2869478
  },
  "ภูเก็ต|เมืองภูเก็ต": {
    "lat": 7.8741947,
    "lng": 98.3939158
  },
  "ภูเก็ต|กะทู้": {
    "lat": 7.8969151,
    "lng": 98.3020123
  },
  "ภูเก็ต|ถลาง": {
    "lat": 8.0320027,
    "lng": 98.3334626
  },
  "สุราษฎร์ธานี|เมืองสุราษฎร์ธานี": {
    "lat": 9.1367639,
    "lng": 99.3007367
  },
  "สุราษฎร์ธานี|กาญจนดิษฐ์": {
    "lat": 9.1066885,
    "lng": 99.406167
  },
  "สุราษฎร์ธานี|ดอนสัก": {
    "lat": 9.2575877,
    "lng": 99.7009754
  },
  "สุราษฎร์ธานี|เกาะสมุย": {
    "lat": 9.4693943,
    "lng": 99.9688636
  },
  "สุราษฎร์ธานี|เกาะพะงัน": {
    "lat": 9.7318753,
    "lng": 100.0135929
  },
  "สุราษฎร์ธานี|ไชยา": {
    "lat": 9.3895033,
    "lng": 99.1957644
  },
  "สุราษฎร์ธานี|ท่าชนะ": {
    "lat": 9.1367384,
    "lng": 99.326928
  },
  "สุราษฎร์ธานี|คีรีรัฐนิคม": {
    "lat": 9.032151,
    "lng": 98.9497191
  },
  "สุราษฎร์ธานี|บ้านตาขุน": {
    "lat": 9.1296714,
    "lng": 98.704075
  },
  "สุราษฎร์ธานี|พนม": {
    "lat": 8.8324975,
    "lng": 98.7811645
  },
  "สุราษฎร์ธานี|ท่าฉาง": {
    "lat": 9.1828363,
    "lng": 99.1314766
  },
  "สุราษฎร์ธานี|บ้านนาสาร": {
    "lat": 8.8185818,
    "lng": 99.3562094
  },
  "สุราษฎร์ธานี|บ้านนาเดิม": {
    "lat": 8.8744911,
    "lng": 99.3007367
  },
  "สุราษฎร์ธานี|เคียนซา": {
    "lat": 8.791605,
    "lng": 99.1234795
  },
  "สุราษฎร์ธานี|เวียงสระ": {
    "lat": 8.6427408,
    "lng": 99.4228263
  },
  "สุราษฎร์ธานี|พระแสง": {
    "lat": 8.5971836,
    "lng": 99.0571089
  },
  "สุราษฎร์ธานี|พุนพิน": {
    "lat": 9.1118027,
    "lng": 99.2065202
  },
  "สุราษฎร์ธานี|ชัยบุรี": {
    "lat": 8.4334494,
    "lng": 99.0902873
  },
  "สุราษฎร์ธานี|วิภาวดี": {
    "lat": 9.2466294,
    "lng": 98.8940878
  },
  "ระนอง|เมืองระนอง": {
    "lat": 9.9720393,
    "lng": 98.6400885
  },
  "ระนอง|ละอุ่น": {
    "lat": 10.0418948,
    "lng": 98.8032042
  },
  "ระนอง|กะเปอร์": {
    "lat": 9.584814,
    "lng": 98.594312
  },
  "ระนอง|กระบุรี": {
    "lat": 10.6289183,
    "lng": 98.8803925
  },
  "ระนอง|สุขสำราญ": {
    "lat": 9.58467,
    "lng": 98.591121
  },
  "ชุมพร|เมืองชุมพร": {
    "lat": 10.497836,
    "lng": 99.1788304
  },
  "ชุมพร|ท่าแซะ": {
    "lat": 10.6767055,
    "lng": 99.1566855
  },
  "ชุมพร|ปะทิว": {
    "lat": 10.7728134,
    "lng": 99.3007367
  },
  "ชุมพร|หลังสวน": {
    "lat": 9.9133345,
    "lng": 99.0571089
  },
  "ชุมพร|ละแม": {
    "lat": 9.710348,
    "lng": 99.0080131
  },
  "ชุมพร|พะโต๊ะ": {
    "lat": 9.8433842,
    "lng": 98.7982301
  },
  "ชุมพร|สวี": {
    "lat": 10.2678834,
    "lng": 99.0571089
  },
  "ชุมพร|ทุ่งตะโก": {
    "lat": 10.1357375,
    "lng": 99.0930936
  },
  "สงขลา|เมืองสงขลา": {
    "lat": 7.1100606,
    "lng": 100.6309169
  },
  "สงขลา|สทิงพระ": {
    "lat": 7.4660607,
    "lng": 100.417181
  },
  "สงขลา|จะนะ": {
    "lat": 6.8447264,
    "lng": 100.6647101
  },
  "สงขลา|นาทวี": {
    "lat": 6.6759811,
    "lng": 100.6647101
  },
  "สงขลา|เทพา": {
    "lat": 7.2053611,
    "lng": 100.5897837
  },
  "สงขลา|สะบ้าย้อย": {
    "lat": 6.5858886,
    "lng": 100.9354944
  },
  "สงขลา|ระโนด": {
    "lat": 7.1645048,
    "lng": 100.5516002
  },
  "สงขลา|กระแสสินธุ์": {
    "lat": 7.5640189,
    "lng": 100.3385624
  },
  "สงขลา|รัตภูมิ": {
    "lat": 7.1088425,
    "lng": 100.2151578
  },
  "สงขลา|สะเดา": {
    "lat": 6.6364833,
    "lng": 100.4238366
  },
  "สงขลา|หาดใหญ่": {
    "lat": 7.0200017,
    "lng": 100.3947116
  },
  "สงขลา|นาหม่อม": {
    "lat": 6.9586209,
    "lng": 100.5352367
  },
  "สงขลา|ควนเนียง": {
    "lat": 7.1891077,
    "lng": 100.3538555
  },
  "สงขลา|บางกล่ำ": {
    "lat": 7.1095065,
    "lng": 100.4227992
  },
  "สงขลา|สิงหนคร": {
    "lat": 7.2094846,
    "lng": 100.4621366
  },
  "สงขลา|คลองหอยโข่ง": {
    "lat": 6.8491448,
    "lng": 100.2918504
  },
  "สตูล|เมืองสตูล": {
    "lat": 6.7117369,
    "lng": 99.9688636
  },
  "สตูล|ควนโดน": {
    "lat": 6.7934717,
    "lng": 100.1031202
  },
  "สตูล|ควนกาหลง": {
    "lat": 6.863158,
    "lng": 100.016921
  },
  "สตูล|ท่าแพ": {
    "lat": 6.7971845,
    "lng": 99.9241575
  },
  "สตูล|ละงู": {
    "lat": 6.86835,
    "lng": 99.790629
  },
  "สตูล|ทุ่งหว้า": {
    "lat": 7.0552384,
    "lng": 99.745565
  },
  "สตูล|มะนัง": {
    "lat": 7.009016,
    "lng": 99.9241575
  },
  "ตรัง|เมืองตรัง": {
    "lat": 7.5593592,
    "lng": 99.6109944
  },
  "ตรัง|กันตัง": {
    "lat": 7.4017771,
    "lng": 99.4783816
  },
  "ตรัง|ย่านตาขาว": {
    "lat": 7.4029206,
    "lng": 99.6731188
  },
  "ตรัง|ปะเหลียน": {
    "lat": 7.2282459,
    "lng": 99.6118667
  },
  "ตรัง|สิเกา": {
    "lat": 7.5758254,
    "lng": 99.3451118
  },
  "ตรัง|ห้วยยอด": {
    "lat": 7.7734885,
    "lng": 99.6230001
  },
  "ตรัง|วังวิเศษ": {
    "lat": 7.7390363,
    "lng": 99.4281836
  },
  "ตรัง|นาโยง": {
    "lat": 7.5625513,
    "lng": 99.7065478
  },
  "ตรัง|รัษฎา": {
    "lat": 7.4125979,
    "lng": 99.5096355
  },
  "ตรัง|หาดสำราญ": {
    "lat": 7.2400742,
    "lng": 99.5562219
  },
  "พัทลุง|เมืองพัทลุง": {
    "lat": 7.6166932,
    "lng": 100.074051
  },
  "พัทลุง|กงหรา": {
    "lat": 7.4347427,
    "lng": 99.9241575
  },
  "พัทลุง|เขาชัยสน": {
    "lat": 7.4469444,
    "lng": 100.1277778
  },
  "พัทลุง|ตะโหมด": {
    "lat": 7.2621533,
    "lng": 100.0135929
  },
  "พัทลุง|ควนขนุน": {
    "lat": 7.776218,
    "lng": 99.9688636
  },
  "พัทลุง|ปากพะยูน": {
    "lat": 7.3293411,
    "lng": 100.3385624
  },
  "พัทลุง|ศรีบรรพต": {
    "lat": 7.6925121,
    "lng": 99.8794744
  },
  "พัทลุง|ป่าบอน": {
    "lat": 7.2166013,
    "lng": 100.1479182
  },
  "พัทลุง|บางแก้ว": {
    "lat": 7.4286324,
    "lng": 100.1927389
  },
  "พัทลุง|ป่าพะยอม": {
    "lat": 7.8571319,
    "lng": 99.9520961
  },
  "พัทลุง|ศรีนครินทร์": {
    "lat": 7.5629896,
    "lng": 99.9241575
  },
  "ปัตตานี|เมืองปัตตานี": {
    "lat": 6.8626351,
    "lng": 101.2637155
  },
  "ปัตตานี|โคกโพธิ์": {
    "lat": 6.7296038,
    "lng": 101.0938079
  },
  "ปัตตานี|หนองจิก": {
    "lat": 6.843701,
    "lng": 101.177943
  },
  "ปัตตานี|ปะนาเระ": {
    "lat": 6.857847,
    "lng": 101.48952
  },
  "ปัตตานี|มายอ": {
    "lat": 6.720268,
    "lng": 101.412981
  },
  "ปัตตานี|ทุ่งยางแดง": {
    "lat": 6.720268,
    "lng": 101.412981
  },
  "ปัตตานี|สายบุรี": {
    "lat": 6.705524,
    "lng": 101.61831
  },
  "ปัตตานี|ไม้แก่น": {
    "lat": 6.613429,
    "lng": 101.669015
  },
  "ปัตตานี|ยะหริ่ง": {
    "lat": 6.862583,
    "lng": 101.369112
  },
  "ปัตตานี|ยะรัง": {
    "lat": 6.758667,
    "lng": 101.293631
  },
  "ปัตตานี|กะพ้อ": {
    "lat": 6.561236,
    "lng": 101.53465
  },
  "ปัตตานี|แม่ลาน": {
    "lat": 6.675485,
    "lng": 101.151025
  },
  "ยะลา|เมืองยะลา": {
    "lat": 6.5411376,
    "lng": 101.280396
  },
  "ยะลา|เบตง": {
    "lat": 5.7799851,
    "lng": 101.0372376
  },
  "ยะลา|บันนังสตา": {
    "lat": 6.242799,
    "lng": 101.2977322
  },
  "ยะลา|ธารโต": {
    "lat": 6.1399312,
    "lng": 101.2297105
  },
  "ยะลา|ยะหา": {
    "lat": 6.4866666,
    "lng": 101.1504111
  },
  "ยะลา|รามัน": {
    "lat": 6.4918217,
    "lng": 101.3885001
  },
  "ยะลา|กาบัง": {
    "lat": 6.4374668,
    "lng": 101.0033112
  },
  "ยะลา|กรงปินัง": {
    "lat": 6.4261463,
    "lng": 101.2807224
  },
  "นราธิวาส|เมืองนราธิวาส": {
    "lat": 6.427987,
    "lng": 101.82259
  },
  "นราธิวาส|ตากใบ": {
    "lat": 6.258638,
    "lng": 102.055363
  },
  "นราธิวาส|บาเจาะ": {
    "lat": 6.514835,
    "lng": 101.654187
  },
  "นราธิวาส|ยี่งอ": {
    "lat": 6.3852868,
    "lng": 101.7011363
  },
  "นราธิวาส|ระแงะ": {
    "lat": 6.294943,
    "lng": 101.717652
  },
  "นราธิวาส|รือเสาะ": {
    "lat": 6.391198,
    "lng": 101.518275
  },
  "นราธิวาส|ศรีสาคร": {
    "lat": 6.23204,
    "lng": 101.501198
  },
  "นราธิวาส|แว้ง": {
    "lat": 5.9278169,
    "lng": 101.8848056
  },
  "นราธิวาส|สุคิริน": {
    "lat": 5.938557,
    "lng": 101.779963
  },
  "นราธิวาส|สุไหงโกลก": {
    "lat": 6.020954,
    "lng": 101.952146
  },
  "นราธิวาส|สุไหงปาดี": {
    "lat": 6.0835102,
    "lng": 101.9119871
  },
  "นราธิวาส|จะแนะ": {
    "lat": 6.168756,
    "lng": 101.697864
  },
  "นราธิวาส|เจาะไอร้อง": {
    "lat": 6.294943,
    "lng": 101.717652
  }
};

export function getProvinceCoordinates(province: string): Coordinates {
  return provinceCoordinates[province] || { lat: 13.7563, lng: 100.5018 }; // Default to Bangkok
}

export function getDistrictCoordinates(province: string, district: string): Coordinates {
  const key = province + '|' + district;
  return districtCoordinates[key] || getProvinceCoordinates(province);
}
